<div id="main-midle">
	<h1>Глава №3</h1>
<h2>Поняття задачі лінійного програмування та різні форми її задання</h2>
<p> <b></b></p>
<p><i>Під <b>задачею</b> лінійного програмування в загальному вигляді розуміють задачу знаходження мінімуму (максимуму) лінійної функції від <sub><img src="/img/image004.gif"></sub> змінних на множині розв’язків системи лінійних нерівностей або лінійних рівнянь.</i> Розглянемо це на конкретному прикладі.</p>
<p><b>Задача 3.1.</b> Завод додатково освоїв випуск продукції чотирьох асортиментів <sub><img src="/img/image071.gif"></sub>. Для випуску цієї продукції потрібна сировина чотирьох видів <sub><img src="/img/image073.gif"></sub>, яку завод може щомісячно виділяти в обмеженій кількості. Кількість сировини кожного виду, необхідної для виготовлення кожного виду продукції, ціна кожного виду продукції , а також лімітоване щомісячне надходження потрібної сировини подано в таблиці 3.1.</p>
<p>Таблиця 3.1.</p>
<table border=1>
<tr>
<td rowspan=2></p>
<p>Сировина</td>
<td rowspan=2>Щомісячне надходження сировини (ум.од.)</td>
<td colspan=4>Витрати сировини на одиницю кожного виробу</td>
</tr>
<tr>
<td><sub><img src="/img/image075.gif"></sub></td>
<td><sub><img src="/img/image077.gif"></sub></td>
<td><sub><img src="/img/image079.gif"></sub></td>
<td><sub><img src="/img/image081.gif"></sub></td>
</tr>
<tr>
<td><i>А<sub>1</sub></i></p>
<p><i>А<sub>2</sub></i></p>
<p><i>А<sub>3</sub></i></p>
<p><i>А<sub>4</sub></i></td>
<td>1260</p>
<p>900</p>
<p>530</p>
<p>210</td>
<td>2</p>
<p>2</p>
<p>0</p>
<p>1</td>
<td>4</p>
<p>2</p>
<p>1</p>
<p>0</td>
<td>6</p>
<p>0</p>
<p>1</p>
<p>1</td>
<td>8</p>
<p>6</p>
<p>2</p>
<p>0</td>
</tr>
<tr>
<td colspan=2>Прибуток від реалізації одиниці виробу</td>
<td>8</td>
<td>10</td>
<td>12</td>
<td>18</td>
</tr>
<tr>
<td colspan=2>Кількість продукції</td>
<td><sub><img src="/img/image083.gif"></sub></td>
<td><sub><img src="/img/image085.gif"></sub></td>
<td><sub><img src="/img/image087.gif"></sub></td>
<td><sub><img src="/img/image089.gif"></sub></td>
</tr>
</table>
<p></p>
<p>Визначити, яку кількість треба випускати заводу кожного з видів продукції <sub><img src="/img/image071.gif"></sub>, щоб прибуток від її реалізації був максимальний.</p>
<p></p>
<p>Складемо математичну модель цієї задачі, тобто опишемо її в термінах математичної символіки. Позначимо через <sub><img src="/img/image091.gif"></sub> відповідно ті кількості продукції асортиментів <sub><img src="/img/image071.gif"></sub>, які треба випустити, щоб мати максимальний прибуток від їх реалізації. Тоді на випуск продукції <sub><img src="/img/image075.gif"></sub> буде витрачено <sub><img src="/img/image094.gif"></sub> умовних одиниць сировини <sub><img src="/img/image096.gif"></sub>; на випуск <sub><img src="/img/image077.gif"></sub> - <sub><img src="/img/image099.gif"></sub>, на випуск <sub><img src="/img/image079.gif"></sub> - <sub><img src="/img/image102.gif"></sub>, на випуск <sub><img src="/img/image081.gif"></sub> - <sub><img src="/img/image104.gif"></sub> умовних одиниць сировини <sub><img src="/img/image096.gif"></sub>. Витрати сировини <sub><img src="/img/image096.gif"></sub> не повинні перевищувати 1260 умовних одиниць. Матимемо таку лінійну нерівність: <sub><img src="/img/image107.gif"></sub>.</p>
<p>За змістом задачі невідомі <sub><img src="/img/image091.gif"></sub> є невід’ємні величини, тобто <sub><img src="/img/image109.gif"></sub> <sub><img src="/img/image111.gif"></sub> <sub><img src="/img/image113.gif"></sub> <sub><img src="/img/image115.gif"></sub>.Аналогічні міркування приводять до такої системи лінійних нерівностей, які накладають обмеження на значення змінних <sub><img src="/img/image091.gif"></sub>: <sub><img src="/img/image117.gif"></sub> <sub><img src="/img/image119.gif"></sub></p>
<p>Прибуток від реалізації випущеної продукції (позначимо її через <sub><img src="/img/image121.gif"></sub>), очевидно визначається так: <sub><img src="/img/image123.gif"></sub></p>
<p>Дані системи лінійних нерівностей і лінійна функція визначають математичну модель розглянутої задачі: <i>знайти такі значення змінних <sub><img src="/img/image091.gif"></sub>, які задовольняють систему отриманих лінійних нерівностей і перетворюють у максимум отриману лінійну функцію <sub><img src="/img/image121.gif"></sub>.</i></p>
<p>Тепер розглянемо чисельне розв’язання таких задач.</p>
<p>У наведеній задачі значення змінних <i><sub><img src="/img/image091.gif"></sub></i> повинні задовольняти систему лінійних нерівностей лише виду <sub><img src="/img/image125.gif"></sub>. Трапляються задачі, де значення змінних задовольняють систему нерівностей лише виду <sub><img src="/img/image127.gif"></sub>, або систему лінійних рівнянь, або мішану систему рівнянь і нерівностей.</p>
<p>Якщо позначити символом <sub><img src="/img/image012.gif"></sub> будь-яке із трьох співвідношень : <sub><img src="/img/image130.gif"></sub>, то математичну модель загальної задачі лінійного програмування можна подати в такому вигляді: <i>знайти такі числові значення змінних <sub><img src="/img/image109.gif"></sub> <sub><img src="/img/image111.gif"></sub>…, <sub><img src="/img/image133.gif"></sub> які задовольняють систему лінійних обмежень:</i></p>
<p><sub><img src="/img/image135.gif"></sub></p>
<p><i>і перетворюють в екстремум (максимум або мінімум) лінійну функцію</i></p>
<p><sub><img src="/img/image137.gif"></sub>.</p>
<p>Цю функцію називають <b><i>цільовою функцією</i></b>, вона моделює поставлену в задачі мету.</p>
<p>У задачах лінійного програмування можна виділити два типи однорідних обмежень на вибір змінних: у вигляді лінійних нерівностей або у вигляді лінійних рівнянь. Крім того, для спрощення можна формулювати задачу лише для мінімуму цільової функції. Якщо ж в конкретній задачі треба визначити максимум функції <sub><img src="/img/image139.gif"></sub>, то це те саме, що шукати мінімум функції <sub><img src="/img/image141.gif"></sub>.</p>
<p>З цього випливають три форми задач лінійного програмування:</p>
<p>1) загальна задача лінійного програмування;</p>
<p>2) стандартна ( симетрична);</p>
<p>3) канонічна.</p>
<p><b><i>Загальна задача</i></b> лінійного програмування подається у вигляді:</p>
<p><sub><img src="/img/image143.gif"></sub> (3.1)</p>
<p>за умов:</p>
<p><sub><img src="/img/image145.gif"></sub> ( 3.2)</p>
<p><i><sub><img src="/img/image109.gif"></sub> <sub><img src="/img/image111.gif"></sub>…, <sub><img src="/img/image147.gif"></sub></i>.  (3.3)</p>
<p>Отже, потрібно знайти значення змінних <sub><img src="/img/image149.gif"></sub>, які задовольняють умови (3.2) і (3.3), і цільова функція (3.1) набуває екстремального (максимального чи мінімального) значення.</p>
<p>Для загальної задачі лінійного програмування використовуються такі поняття.</p>
<p>Вектор <sub><img src="/img/image151.gif"></sub>, координати якого задовольняють систему обмежень (3.2) та умови невід’ємності змінних (3.3), називається <b><i>допустимим розв’язком (планом) задачі лінійного програмування .</i></b></p>
<p>Допустимий план <sub><img src="/img/image151.gif"></sub> називається <b><i>опорним планом</i> </b>задачі лінійного програмування, якщо він задовольняє не менше, ніж <sub><img src="/img/image153.gif"></sub> лінійно незалежних обмежень системи (3.2) у вигляді рівностей, а також обмеження (3.3) щодо невід’ємності змінних.</p>
<p>Опорний план <sub><img src="/img/image151.gif"></sub>, називається <b><i>невиродженим</i></b>, якщо він містить точно <sub><img src="/img/image153.gif"></sub> додатних змінних, інакше він <b><i>вироджений</i></b>.</p>
<p>Опорний план <sub><img src="/img/image156.gif"></sub>, за якого цільова функція (3.1) досягає максимального (чи мінімального) значення, називається <b><i>оптимальним розв’язком (планом) задачі лінійного програмування.</i></b></p>
<p><b><i>Стандартна (симетрична) задача</i></b> лінійного програмування подається у вигляді: <sub><img src="/img/image143.gif"></sub> за умов:</p>
<p><sub><img src="/img/image158.gif"></sub>, або <sub><img src="/img/image160.gif"></sub>.</p>
<p><i><sub><img src="/img/image109.gif"></sub> <sub><img src="/img/image111.gif"></sub>…, <sub><img src="/img/image147.gif"></sub></i>.</p>
<p>Задачу (3.1)-(3.3) можна легко звести до <b><i>канонічної форми</i></b>, тобто до такого вигляду, коли в системі обмежень (3.2) всі <sub><img src="/img/image162.gif"></sub><sub><img src="/img/image164.gif"></sub> невід’ємні, а всі обмеження є рівностями.</p>
<p>Якщо якесь <sub><img src="/img/image162.gif"></sub> від’ємне, то, помноживши <sub><img src="/img/image166.gif"></sub>-те обмеження на -1, дістанемо у правій частині відповідної рівності додатне значення. Коли <sub><img src="/img/image166.gif"></sub>-те обмеження має вигляд нерівності</p>
<p><sub><img src="/img/image168.gif"></sub></p>
<p>то останню завжди можна звести до рівності , увівши <i>додаткову змінну</i> <sub><img src="/img/image170.gif"></sub>:</p>
<p><sub><img src="/img/image172.gif"></sub>.</p>
<p>Аналогічно обмеження виду</p>
<p><sub><img src="/img/image174.gif"></sub></p>
<p>зводиться до рівності, віднімаючи від лівої частини <i>додаткову змінну</i> <sub><img src="/img/image176.gif"></sub>:</p>
<p><sub><img src="/img/image178.gif"></sub>,</p>
<p><sub><img src="/img/image180.gif"></sub></p>
<p>Така заміна нерівностей рівняннями за допомогою введення додаткових змінних не змінить розв’язку початкової задачі.</p>
<p>Задачі лінійного програмування можна розв’язувати графічно і аналітично.</p>
</div>
