<div id="main-midle">
	<h1>Глава №4</h1>
<h2>Геометрична інтерпретація задачі лінійного програмування</h2>
<p>Розглянемо на площині <sub><img src="/img/image182.gif"></sub> сумісну систему лінійних нерівностей:</p>
<p><sub><img src="/img/image184.gif"></sub> <sub><img src="/img/image186.gif"></sub></p>
<p>Кожна нерівність цієї системи геометрично визначає півплощину з граничною прямою <sub><img src="/img/image188.gif"></sub> <sub><img src="/img/image164.gif"></sub>. Умови невід’ємності змінних визначають півплощини з граничними прямими <sub><img src="/img/image191.gif"></sub> та <sub><img src="/img/image193.gif"></sub>. Система сумісна, тому півплощини як опуклі множини, перетинаючись, утворюють спільну частину, що є опуклою множиною і являє собою сукупність точок, координати кожної з яких є розв'язком даної системи (мал. 4.1).</p>
<p><img src="/img/image195.jpg"></p>
<p>Мал. 4.1.</p>
<p>Сукупність цих точок (розв'язків) називають <b><i>багатокутником розв'язків</i></b>, або <b><i>областю допустимих планів (розв'язків) задачі лінійного програмування</i></b>. Це може бути точка (єдиний розв'язок), відрізок, промінь, багатокутник, необмежена багатокутна область.</p>
<p>Якщо в даній системі обмежень буде три змінних, то кожна нерівність геометрично визначатиме півпростір тривимірного простору, граничними площинами якого будуть:</p>
<p><sub><img src="/img/image197.gif"></sub>, <sub><img src="/img/image164.gif"></sub>,</p>
<p>а умови невід’ємності — півпростори з граничними площинами <sub><img src="/img/image199.gif"></sub>, де <sub><img src="/img/image166.gif"></sub> - номер обмеження, а <sub><img src="/img/image201.gif"></sub> - номер змінної. Якщо система обмежень сумісна, то ці півпростори як опуклі множини, перетинаючись, утворять у тривимірному просторі спільну частину, що називається <b><i>багатогранником розв'язків</i></b>. Він може бути точкою, відрізком, променем, багатокутником, багатогранником, багатогранною необмеженою областю.</p>
<p>Нехай у даній системі обмежень кількість змінних більша, ніж три: <sub><img src="/img/image203.gif"></sub>; тоді кожна нерівність визначає півпростір <sub><img src="/img/image004.gif"></sub>-вимірного простору з граничною гіперплощиною <sub><img src="/img/image205.gif"></sub>, <sub><img src="/img/image164.gif"></sub>. Кожному обмеженню відповідають гіперплощина та напівпростір, який лежить з одного боку цієї гіперплощини, а умови невід’ємності — півпростори з граничними гіперплощинами <sub><img src="/img/image207.gif"></sub>.</p>
<p>Якщо система обмежень сумісна, то за аналогією з тривимірним простором вона утворює спільну частину в <sub><img src="/img/image004.gif"></sub>-вимірному просторі — опуклий багатогранник допустимих розв'язків.</p>
<p>Отже, геометрично задача лінійного програмування являє собою відшукання координат такої точки багатогранника розв'язків, при підстановці яких у цільову лінійну функцію остання набирає максимального (мінімального) значення, причому допустимими розв'язками є усі точки багатогранника розв'язків.</p>
<p>Цільову функцію <sub><img src="/img/image139.gif"></sub> в <sub><img src="/img/image004.gif"></sub>-вимірному просторі основних змінних можна геометрично інтерпретувати як сім’ю паралельних гіперплощин, положення кожної з яких визначається значенням параметра Z.</p>
<p>Розглянемо геометричну інтерпретацію задачі лінійного програмування на прикладі.</p>
<p><b>Задача 4.1.</b> Нехай фермер прийняв рішення вирощувати озиму пшеницю і цукрові буряки на площі 20 га, відвівши під цукрові буряки не менше як 5 га. Техніко-економічні показники вирощування цих культур маємо у табл. 4.1:</p>
<p></p>
<p>Таблиця 4.1.</p>
<table border=1>
<tr>
<td>Показник</p>
<p>(із розрахунку на 1 га)</td>
<td>Озима пшениця</td>
<td>Цукрові буряки</td>
<td>Наявний ресурс</td>
</tr>
<tr>
<td>Затрати праці, людино-днів</td>
<td>5</td>
<td>25</td>
<td>270</td>
</tr>
<tr>
<td>Затрати праці механізаторів, людино-днів</td>
<td>2</td>
<td>8</td>
<td>80</td>
</tr>
<tr>
<td>Урожайність, тонн</td>
<td>3,5</td>
<td>40</td>
<td>—</td>
</tr>
<tr>
<td>Прибуток, тис. грн.</td>
<td>0,7</td>
<td>1</td>
<td>—</td>
</tr>
</table>
<p></p>
<p>Критерієм оптимальності є максимізація прибутку.</p>
<p>Запишемо економіко-математичну модель структури виробництва озимої пшениці та цукрових буряків, ввівши такі позначення:</p>
<p><sub><img src="/img/image083.gif"></sub> — шукана площа посіву озимої пшениці, га;</p>
<p><sub><img src="/img/image085.gif"></sub> — шукана площа посіву цукрових буряків, га.</p>
<p>Задача лінійного програмування має такий вигляд: <sub><img src="/img/image212.gif"></sub> за умов:</p>
<p><sub><img src="/img/image214.gif"></sub></p>
<p>Геометричну інтерпретацію задачі зображено на мал.4.2.</p>
<p><img src="/img/image216.jpg"></p>
<p>Мал. 4.2. Область допустимих розв’язків задачі</p>
<p>Область допустимих розв’язків цієї задачі дістаємо так. Кожне обмеження, наприклад <sub><img src="/img/image218.gif"></sub>, задає півплощину з граничною прямою <sub><img src="/img/image218.gif"></sub>. Будуємо її і визначаємо півплощину, яка описується нерівністю <sub><img src="/img/image218.gif"></sub>. З цією метою в нерівність <sub><img src="/img/image218.gif"></sub> підставляємо координати характерної точки, скажімо, <sub><img src="/img/image221.gif"></sub>і <sub><img src="/img/image193.gif"></sub>. Переконуємося, що ця точка належить півплощині <sub><img src="/img/image218.gif"></sub>. Цей факт на мал.4.2 ілюструємо відповідною напрямленою стрілкою. Аналогічно будуємо півплощини, які відповідають й іншим нерівностям. У результаті перетину цих півплощин утворюється область допустимих розв'язків задачі (на мал.4.2 — чотирикутник АВСD). Цільова функція <sub><img src="/img/image224.gif"></sub> являє собою сім’ю паралельних прямих, кожна з яких відповідає певному значенню Z. Зокрема, якщо Z = 0, то маємо <sub><img src="/img/image226.gif"></sub>. Ця пряма проходить через початок системи координат. Коли Z = 3,5, то маємо пряму <sub><img src="/img/image228.gif"></sub>.</p>
<p><b><i>Основні властивості розв’язків задачі лінійного програмування</i></b>. Властивості розв’язків задачі лінійного програмування формулюються у вигляді чотирьох теорем.</p>
<p><b><i>Теорема 4.1.</i> </b><i>Множина всіх планів задачі лінійного програмування опукла.</i></p>
<p><b><i>Доведення.</i></b> <i></i>Необхідно довести, що коли <sub><img src="/img/image230.gif"></sub> та <sub><img src="/img/image232.gif"></sub> - плани задачі лінійного програмування (3.1)-(3.3), то їх опукла комбінація <sub><img src="/img/image234.gif"></sub> також є планом задачі.</p>
<p>Так як <sub><img src="/img/image230.gif"></sub> та <sub><img src="/img/image232.gif"></sub> - плани задачі, то виконуються такі співвідношення:</p>
<p><sub><img src="/img/image236.gif"></sub></p>
<p>Якщо підставити в систему обмежень значення <i>Х</i>, то отримаємо: <sub><img src="/img/image238.gif"></sub>.</p>
<p>Отримали, що <i>Х</i> задовольняє систему обмежень задачі лінійного програмування (3.2), і оскільки <sub><img src="/img/image240.gif"></sub>то й <sub><img src="/img/image242.gif"></sub>, тобто задовольняють і умову (3.3). У такий спосіб доведено, що <i>Х</i> – план задачі лінійного програмування.</p>
<p><b><i>Теорема 4.2</i></b><i>. Якщо задача лінійного програмування має оптимальний план, то екстремального значення цільова функція набуває в одній із вершин багатогранника розв’язків. Якщо цільова функція набуває екстремального значення більш як в одній вершині цього багатогранника, то вона досягає його і в будь-якій точці, що є лінійною комбінацією таких вершин.</i></p>
<p><b><i>Теорема 4.3.</i> </b><i>Якщо відомо, що система векторів <sub><img src="/img/image244.gif"></sub> у розкладі <sub><img src="/img/image246.gif"></sub> лінійно незалежна і така, що</i></p>
<p><i><sub><img src="/img/image248.gif"></sub></i></p>
<p><i>де всі <sub><img src="/img/image250.gif"></sub>, то точка <sub><img src="/img/image252.gif"></sub> є кутовою точкою багатогранника розв’язків.</i></p>
<p><b><i>Доведення.</i></b> Припустимо, що точка <i>Х</i> не є кутовою. Тоді вона може бути виражена опуклою лінійною комбінацією двох інших точок <sub><img src="/img/image230.gif"></sub> та <sub><img src="/img/image232.gif"></sub> багатогранника розв’язків, тобто:</p>
<p><sub><img src="/img/image234.gif"></sub>.</p>
<p>Компоненти векторів <sub><img src="/img/image230.gif"></sub> та <sub><img src="/img/image232.gif"></sub>, значення <sub><img src="/img/image254.gif"></sub> та <sub><img src="/img/image256.gif"></sub> невід’ємні і останні <i>n-k</i> компонентів вектора <i>Х</i> дорівнюють нулю, тому відповідні <i>n-k</i> компонент векторів <sub><img src="/img/image230.gif"></sub> та <sub><img src="/img/image232.gif"></sub> також мають дорівнювати нулю, тобто</p>
<p><sub><img src="/img/image258.gif"></sub>,</p>
<p><sub><img src="/img/image260.gif"></sub>.</p>
<p>Оскільки <sub><img src="/img/image230.gif"></sub> та <sub><img src="/img/image232.gif"></sub> - плани, то</p>
<p><sub><img src="/img/image262.gif"></sub>,</p>
<p><sub><img src="/img/image264.gif"></sub>.</p>
<p>Віднімаючи від першого рівняння друге, отримаємо:</p>
<p><sub><img src="/img/image266.gif"></sub></p>
<p>За припущенням вектори <sub><img src="/img/image268.gif"></sub>лінійно незалежні, тому останнє співвідношення виконується, якщо</p>
<p><sub><img src="/img/image270.gif"></sub></p>
<p>Звідки: <sub><img src="/img/image272.gif"></sub>.</p>
<p>Отже, <i>Х</i> неможливо подати як опуклу лінійну комбінацію двох інших точок багатокутника розв’язків. Значить, <i>Х</i> – кутова точка.</p>
<p><b><i>Теорема 4.4.</i> </b><i>Якщо <sub><img src="/img/image274.gif"></sub> - кутова точка багатогранника розв’язків, то вектори в розкладі <sub><img src="/img/image246.gif"></sub>, що відповідають додатним <sub><img src="/img/image276.gif"></sub>, є лінійно незалежними.</i></p>
<p><b><i>Наслідки</i></b><i>:</i></p>
<p><b><i>1)</i> </b>Оскільки вектори <sub><img src="/img/image278.gif"></sub> мають розмірність <i>m</i>, то кутова точка багатокутника розв’язків має не більше, ніж <i>m</i> додатних компонентів <sub><img src="/img/image280.gif"></sub>.</p>
<p><b><i>2)</i> </b>Кожній кутовій точці багатокутника розв’язків відповідає <sub><img src="/img/image282.gif"></sub> лінійно незалежних векторів системи <sub><img src="/img/image278.gif"></sub>.</p>
<p>З наведених властивостей можна зробити наступні <b><i>висновки</i>:</b> якщо функціонал задачі лінійного програмування обмежений на багатограннику розв’язків, то:</p>
<p><b><i>1)</i></b> <i>існує така кутова точка багатогранника розв’язків, в якій лінійний функціонал досягає свого оптимального значення;</i></p>
<p><b><i>2)</i></b> <i>кожний опорний план відповідає кутовій точці багатогранника розв’язків.</i></p>
<p>Тому для розв’язання задачі лінійного програмування необхідно досліджувати лише кутові точки багатогранника (опорні плани), не включаючи до розгляду внутрішні точки множини допустимих планів.</p>
<p></p>
<p><b>4.1. Графічний метод розв'язування задач лінійного програмування</b></p>
<p> <b></b></p>
<p>Для розв'язування двовимірних задач лінійного програмування, тобто задач із двома змінними, а також деяких тривимірних задач застосовують графічний метод, що ґрунтується на геометричній інтерпретації та аналітичних властивостях задач лінійного програмування. Обмежене використання графічного методу зумовлене складністю побудови багатогранника розв'язків у тривимірному просторі (для задач з трьома змінними), а графічне зображення задачі з кількістю змінних більше трьох взагалі неможливе.</p>
<p>Розглянемо задачу.</p>
<p>Знайти</p>
<p><sub><img src="/img/image284.gif"></sub> (4.1.1)</p>
<p>за умов:</p>
<p><sub><img src="/img/image286.gif"></sub> (4.1.2)</p>
<p><i><sub><img src="/img/image109.gif"></sub><sub><img src="/img/image288.gif"></sub>.</i>  (4.1.3)</p>
<p>Припустимо, що система (4.1.2) за умов (4.1.3) сумісна і багатокутник її розв'язків обмежений.</p>
<p>Згідно з геометричною інтерпретацією задачі лінійного програмування кожне <i>і</i>-те обмеження-нерівність у (4.1.2) визначає півплощину з граничною прямою <sub><img src="/img/image290.gif"></sub>. Системою обмежень (4.1.2) графічно можна зобразити спільну частину, або переріз усіх зазначених півплощин, тобто множину точок, координати яких задовольняють всі обмеження задачі - багатокутник розв'язків.</p>
<p>Умова (4.1.3) невід'ємності змінних означає, що область допустимих розв'язків задачі належить першому квадранту системи координат двовимірного простору. Цільова функція задачі лінійного програмування геометрично інтерпретується як сім'я паралельних прямих <sub><img src="/img/image292.gif"></sub>.</p>
<p>Скористаємося для графічного розв'язання задачі лінійного програмування основними властивостями розв’язків задачі лінійного програмування: якщо задача лінійного програмування має оптимальний план, то екстремального значення цільова функція набуває в одній із вершин її багатокутника розв'язків. Якщо ж цільова функція досягає екстремального значення більш як в одній вершині багатокутника, то вона досягає його і в будь-якій точці, що є лінійною комбінацією цих вершин.</p>
<p>Отже, розв'язати задачу лінійного програмування графічно означає знайти таку вершину багатокутника розв'язків, у результаті підстановки координат якої в (4.1.1) лінійна цільова функція набуває найбільшого (найменшого) значення.</p>
<p><b><i>Алгоритм графічного методу</i></b> розв'язування задачі лінійного програмування складається з таких кроків:</p>
<p><b>1.</b> Будуємо прямі, рівняння яких дістаємо заміною в обмеженнях задачі (1.4.2) знаків нерівностей на знаки рівностей.</p>
<p><b>2.</b> Визначаємо півплощини, що відповідають кожному обмеженню задачі.</p>
<p><b>3.</b> Знаходимо багатокутник розв'язків задачі лінійного програмування.</p>
<p><b>4.</b> Будуємо вектор <sub><img src="/img/image294.gif"></sub>, що задає напрям зростання значення цільової функції задачі.</p>
<p><b>5.</b> Будуємо пряму <sub><img src="/img/image292.gif"></sub>, перпендикулярну до вектора <sub><img src="/img/image296.gif"></sub>.</p>
<p><b>6.</b> Рухаючи пряму <sub><img src="/img/image292.gif"></sub> в напрямку вектора <sub><img src="/img/image296.gif"></sub> (для задачі максимізації) або в протилежному напрямі (для задачі мінімізації), знаходимо вершину багатокутника розв'язків, де цільова функція набирає екстремального значення.</p>
<p><b>7.</b> Визначаємо координати точки, в якій цільова функція набирає максимального (мінімального) значення, і обчислюємо екстремальне значення цільової функції в цій точці.</p>
<p>У разі застосування графічного методу для розв'язування задач лінійного програмування можливі такі випадки:</p>
<p>1. Цільова функція набирає максимального значення в єдиній вершині <i>А</i> багатокутника розв'язків (мал. 4.1.1).</p>
<p>2. Максимального значення цільова функція досягає в будь-якій точці відрізка <i>АВ</i> (мал. 4.1.2). Тоді задача лінійного програмування має альтернативні оптимальні плани.</p>
<p>3. Задача лінійного програмування не має оптимальних планів: якщо цільова функція необмежена згори (мал. 4.1.3) або система обмежень задачі несумісна (мал. 4.1.4).</p>
<p><img src="/img/image298.jpg"></p>
<p>  Мал. 4.1.1  Мал. 4.1.2</p>
<p></p>
<p><img src="/img/image300.jpg"> <img src="/img/image302.jpg"></p>
<p> Мал. 4.1.3. Мал. 4.1.4</p>
<p>4. Задача лінійного програмування має оптимальний план за необмеженої області допустимих розв'язків (мал. 4.1.5 та 4.1.6). На мал. 4.1.5 у точці <i>В</i> маємо максимум, на мал. 4.1.6 у точці <i>А</i> — мінімум, на мал. 4.1.7 зображено, як у разі необмеженої області допустимих планів цільова функція може набирати максимального чи мінімального значення у будь-якій точці променя.</p>
<p><img src="/img/image304.jpg"></p>
<p> Мал. 4.1.5. Мал. 4.1.6.</p>
<p><img src="/img/image306.jpg"></p>
<p>Мал. 4.1.7.</p>
<p>Розв'язувати графічним методом можна також задачі лінійного програмування <i>n</i>-вимірного простору, де <i>n</i>&gt;3, якщо при зведенні системи нерівностей задачі до системи рівнянь шляхом введення додаткових змінних кількість змінних <i>n</i> на дві більша, ніж число обмежень <i>m</i>, тобто <sub><img src="/img/image308.gif"></sub>.</p>
<p>Тоді, як відомо з курсу вищої математики, можна дві з <i>n</i> змінних, наприклад <sub><img src="/img/image083.gif"></sub> та <sub><img src="/img/image085.gif"></sub>, вибрати як вільні, а інші <i>m</i> зробити базисними і виразити через вільні. Припустимо, що це зроблено. Отримаємо <sub><img src="/img/image313.gif"></sub> рівнянь виду:</p>
<p><sub><img src="/img/image315.gif"></sub></p>
<p>Оскільки всі значення <sub><img src="/img/image317.gif"></sub>, то мають виконуватись умови:</p>
<p><sub><img src="/img/image319.gif"></sub></p>
<p><sub><img src="/img/image321.gif"></sub></p>
<p>Розглянемо, як можна зобразити ці умови геометрично. Візьмемо, наприклад, першу з них: <sub><img src="/img/image323.gif"></sub>.</p>
<p>Узявши величину <sub><img src="/img/image087.gif"></sub> рівною своєму крайньому значенню — нулю, отримаємо рівняння: <sub><img src="/img/image326.gif"></sub>.</p>
<p>Це рівняння прямої. Для такої прямої <sub><img src="/img/image328.gif"></sub>, по одну сторону від неї <sub><img src="/img/image330.gif"></sub>, а по другу — <sub><img src="/img/image332.gif"></sub>. Відмітимо ту сторону прямої <sub><img src="/img/image326.gif"></sub>, де <sub><img src="/img/image330.gif"></sub>.</p>
<p>В аналогічний спосіб побудуємо і всі інші обмежуючі прямі: <sub><img src="/img/image334.gif"></sub> і відмітимо для кожної з них півплощину, де відповідна змінна більше нуля.</p>
<p>У такий спосіб отримують <sub><img src="/img/image336.gif"></sub> прямі та дві осі координат <sub><img src="/img/image338.gif"></sub>. Кожна з них визначає півплощину, де виконується умова <sub><img src="/img/image340.gif"></sub>. Частина площини в <sub><img src="/img/image182.gif"></sub> належить водночас всім півплощинам, утворюючи багатокутник допустимих розв'язків.</p>
<p>Припустимо, що в задачі необхідно знайти максимальне значення функціонала: <sub><img src="/img/image342.gif"></sub>,</p>
<p>Підставивши вирази для <sub><img src="/img/image344.gif"></sub> з останньої системи у цей функціонал, зведемо подібні доданки і отримаємо вираз лінійної функції <i>F</i> всіх <i>n</i> змінних лише через дві вільні змінні <sub><img src="/img/image083.gif"></sub> та <sub><img src="/img/image085.gif"></sub>:</p>
<p><sub><img src="/img/image346.gif"></sub></p>
<p>де <sub><img src="/img/image348.gif"></sub> — вільний член, якого в початковому вигляді функціонала не було.</p>
<p>Очевидно, що лінійна функція <sub><img src="/img/image350.gif"></sub> досягає свого максимального значення за тих самих значень <sub><img src="/img/image083.gif"></sub> та <sub><img src="/img/image085.gif"></sub>, що й <sub><img src="/img/image352.gif"></sub>. Отже, процедура відшукання оптимального плану з множини допустимих далі здійснюється за алгоритмом для випадку двох змінних.</p>
<p><b>Задача 4.1.</b> Розв'язати графічним методом задачу лінійного програмування</p>
<p><sub><img src="/img/image354.gif"></sub></p>
<p><sub><img src="/img/image356.gif"></sub></p>
<p><sub><img src="/img/image358.gif"></sub>.</p>
<p>Маємо <sub><img src="/img/image360.gif"></sub> — кількість змінних, <sub><img src="/img/image362.gif"></sub> — кількість обмежень. Виберемо як вільні змінні <sub><img src="/img/image083.gif"></sub> та <sub><img src="/img/image085.gif"></sub> і виразимо через них всі інші базисні змінні. З першого рівняння маємо: <sub><img src="/img/image364.gif"></sub>. З третього рівняння: <sub><img src="/img/image366.gif"></sub>, а з четвертого: <sub><img src="/img/image368.gif"></sub>.</p>
<p>Підставляючи значення <sub><img src="/img/image087.gif"></sub> в друге рівняння системи і <sub><img src="/img/image370.gif"></sub> в останнє, розв'язуємо їх відносно <sub><img src="/img/image089.gif"></sub> та <sub><img src="/img/image373.gif"></sub>. Отримаємо:</p>
<p><sub><img src="/img/image375.gif"></sub>; <sub><img src="/img/image377.gif"></sub>.</p>
<p>Далі за алгоритмом беремо <sub><img src="/img/image191.gif"></sub> та <sub><img src="/img/image193.gif"></sub> — координатні осі; інші обмежуючі прямі знаходимо, узявши <sub><img src="/img/image381.gif"></sub>Багатокутник допустимих розв'язків зображено на мал. 4.1.8.</p>
<p><img src="/img/image383.jpg"></p>
<p> Мал. 4.1.8.   Мал. 4.1.9.</p>
<p>Знайдемо вигляд функціонала, вираженого через <sub><img src="/img/image083.gif"></sub> та <sub><img src="/img/image085.gif"></sub>. Для цього знайдені щойно вирази для <sub><img src="/img/image385.gif"></sub> та <sub><img src="/img/image373.gif"></sub> через вільні змінні <sub><img src="/img/image083.gif"></sub> і <sub><img src="/img/image085.gif"></sub> підставимо у функціонал і, звівши подібні члени, отримаємо: <sub><img src="/img/image388.gif"></sub>. Відкидаючи вільний член, маємо: <sub><img src="/img/image390.gif"></sub>.</p>
<p>Будуємо вектор <sub><img src="/img/image392.gif"></sub>, перпендикулярно до нього — пряму <sub><img src="/img/image394.gif"></sub>. Рухаючи пряму <sub><img src="/img/image396.gif"></sub> в напрямку, протилежному <sub><img src="/img/image296.gif"></sub> (необхідно знайти мінімальне значення функції <sub><img src="/img/image394.gif"></sub>), отримаємо точку мінімуму — <i>А</i> (мал. 4.1.9).</p>
<p>У точці <i>А</i> перетинаються дві обмежуючі прямі: <sub><img src="/img/image400.gif"></sub> та <sub><img src="/img/image402.gif"></sub>. Отже, для відшукання її координат необхідно розв'язати систему рівнянь:</p>
<p><sub><img src="/img/image404.gif"></sub></p>
<p>Розв'язком системи є <sub><img src="/img/image406.gif"></sub>. Підставивши ці значення у відповідні вирази, знайдемо оптимальні значення базисних змінних:</p>
<p><sub><img src="/img/image408.gif"></sub></p>
<p>Підстановкою значень <sub><img src="/img/image410.gif"></sub> та <sub><img src="/img/image412.gif"></sub> в лінійну функцію <sub><img src="/img/image394.gif"></sub> отримуємо значення цільової функції: <i><sub><img src="/img/image414.gif"></sub></i></p>
</div>
