<div id="main-midle">
	<h1>Глава №5</h1>
	<h2>Симплексний метод розв'язування задач лінійного програмування</h2>
<p>Графічний метод для визначення оптимального плану задач лінійного програмування доцільно застосовувати лише для задач із двома змінними. За більшої кількості змінних необхідно застосовувати інший метод. З властивостей розв'язків задачі лінійного програмування відомо: оптимальний розв'язок задачі має знаходитись в одній з кутових точок багатогранника допустимих розв'язків. Тому найпростіший спосіб відшукання оптимального плану потребує перебору всіх кутових точок (допустимих планів задачі, які ще називають опорними). Порівняння вершин багатогранника можна здійснювати тільки після відшукання якоїсь однієї з них, тобто знайшовши початковий опорний план. Кожний опорний план визначається системою <i>m</i> лінійно незалежних векторів, які містяться в системі обмежень задачі з <i>n</i> векторів <sub><img src="/img/image416.gif"></sub> . Отже, загальна кількість опорних планів визначається <b></b>кількістю комбінацій <sub><img src="/img/image418.gif"></sub>. Задачі, що описують реальні економічні процеси, мають велику розмірність, і простий перебір всіх опорних планів таких задач є дуже складним, навіть за умови застосування сучасних ЕОМ. Тому необхідне використання методу, який уможливлював би скорочення кількості обчислень. 1949 року такий метод був запропонований американським вченим Дж.Данцігом — так званий симплексний метод, або <b><i>симплекс-метод</i></b>.</p>
<p>Ідея цього методу полягає в здійсненні спрямованого перебору допустимих планів у такий спосіб, що на кожному кроці здійснюється перехід від одного опорного плану до наступного, який за значенням цільової функції був би хоча б не гіршим за попередній. Значення функціонала при переході змінюється в потрібному напрямку: збільшується (для задачі на максимум) чи зменшується (для задачі на мінімум).</p>
<p>Процес розв'язання задачі симплекс-методом має ітераційний характер: однотипні обчислювальні процедури (ітерації) повторюються у певній послідовності доти, доки не буде отримано оптимальний план задачі або з'ясовано, що його не існує.</p>
<p>Отже, симплекс-метод — це ітераційна обчислювальна процедура, яка дає змогу, починаючи з певного опорного плану, за скінченну кількість кроків отримати оптимальний план задачі лінійного програмування.</p>
<p><b>5.1. Початковий опорний план</b></p>
<p>Розглянемо задачу лінійного програмування, записану в канонічній формі: <sub><img src="/img/image420.gif"></sub>,</p>
<p><sub><img src="/img/image422.gif"></sub> <sub><img src="/img/image424.gif"></sub></p>
<p>Не порушуючи загальності, допустимо, що система рівнянь містить перші <i>m</i> одиничних векторів. Отримаємо:</p>
<p><sub><img src="/img/image420.gif"></sub> (5.1.1)</p>
<p><sub><img src="/img/image426.gif"></sub> (5.1.2)</p>
<p><sub><img src="/img/image424.gif"></sub>  (5.1.3)</p>
<p>Система обмежень (5.1.2) у векторній формі матиме вигляд:</p>
<p> <sub><img src="/img/image428.gif"></sub>, (5.1.4)</p>
<p>де</p>
<p><sub><img src="/img/image430.gif"></sub>, <sub><img src="/img/image432.gif"></sub>,…,<sub><img src="/img/image434.gif"></sub>, <sub><img src="/img/image436.gif"></sub>, …, <sub><img src="/img/image026.gif"></sub>, <sub><img src="/img/image028.gif"></sub>,</p>
<p><sub><img src="/img/image438.gif"></sub> - лінійно незалежні одиничні вектори <i>m</i>-вимірного простору, що утворюють одиничну матрицю і становлять базис цього простору. Тому в розкладі (5.1.4) базисними змінними будуть <sub><img src="/img/image440.gif"></sub>, а інші змінні – вільні. Прирівняємо всі вільні змінні до нуля, тобто <sub><img src="/img/image442.gif"></sub>. Оскільки <sub><img src="/img/image444.gif"></sub>, а вектори <sub><img src="/img/image438.gif"></sub> - одиничні, то отримаємо один із розв’язків системи обмежень (5.1.2):</p>
<p><sub><img src="/img/image446.gif"></sub>, (5.1.5)</p>
<p>тобто допустимий план.</p>
<p>Такому плану відповідає розклад</p>
<p><sub><img src="/img/image448.gif"></sub>,  (5.1.6)</p>
<p>де <sub><img src="/img/image438.gif"></sub> - лінійно незалежні вектори і за теоремою 4.3 план <sub><img src="/img/image450.gif"></sub> є кутовою точкою багатогранника розв’язків, а отже, може бути початковим опорним планом.</p>
<p><b>5.2. Оптимальний розв’язок. Критерій оптимальності плану</b></p>
<p>Симплексний метод уможливлює направлений перебір опорних планів, тобто перехід від одного плану до іншого, який є хоча б не гіршим від попереднього за значенням функціонала. Отже, окремим питанням стає вибір вектора, який необхідно вводити в базис при здійсненні ітераційної процедури симплексного методу.</p>
<p>Розглянемо задачу лінійного програмування (5.1.1)-(5.1.3).</p>
<p>Допустимо, що вона має опорні плани і вони є не виродженими. Розглянемо початковий опорний план виду (5.1.5), якому відповідає розклад за базисними векторами (5.1.6) та значення функціонала</p>
<p><sub><img src="/img/image452.gif"></sub>.</p>
<p>Кожен з векторів <sub><img src="/img/image438.gif"></sub> можна розкласти за векторами базису, причому у єдиний спосіб:</p>
<p><sub><img src="/img/image454.gif"></sub>,</p>
<p>тому такому розкладу відповідатиме і єдине значення функціонала:</p>
<p><sub><img src="/img/image456.gif"></sub>.</p>
<p>Позначимо через <sub><img src="/img/image458.gif"></sub> коефіцієнт функціонала, що відповідає вектору <sub><img src="/img/image460.gif"></sub>, та <sub><img src="/img/image462.gif"></sub> ( їх називають оцінками відповідних векторів плану) <sub><img src="/img/image464.gif"></sub>. Тоді справедливим є таке твердження (<b><i>умова оптимальності плану</i> </b>задачі лінійного програмування): <i>якщо для деякого плану <sub><img src="/img/image450.gif"></sub> розклад всіх векторів <sub><img src="/img/image460.gif"></sub><sub><img src="/img/image464.gif"></sub> у даному базисі задовольняє умову:</i></p>
<p><i><sub><img src="/img/image467.gif"></sub>,</i></p>
<p><i>то план <sub><img src="/img/image450.gif"></sub> є оптимальним розв’язком задачі лінійного програмування (5.1.1-5.1.3).</i></p>
<p>Аналогічно формулюється умова оптимальності плану задачі на відшукання мінімального значення функціонала: <i>якщо для деякого плану <sub><img src="/img/image450.gif"></sub> розклад всіх векторів <sub><img src="/img/image460.gif"></sub> <sub><img src="/img/image464.gif"></sub> у даному базисі задовольняє умову:</i></p>
<p><i><sub><img src="/img/image469.gif"></sub>,</i></p>
<p><i>то план <sub><img src="/img/image450.gif"></sub> є оптимальним розв’язком задачі лінійного програмування.</i></p>
<p>Отже, для того щоб план задачі лінійного програмування був оптимальним, необхідно і достатньо, щоб його оцінки <sub><img src="/img/image462.gif"></sub> були невід’ємними для задачі на максимум та недодатними для задачі на мінімум.</p>
<p>Умови оптимальності планів задач лінійного програмування є наслідками двох теорем (наведемо їх без доведень).</p>
<p><b><i>Теорема 5.2.1.</i> </b><i>Якщо для деякого вектора <sub><img src="/img/image460.gif"></sub> виконується умова <sub><img src="/img/image471.gif"></sub>, то план <sub><img src="/img/image450.gif"></sub> не є оптимальним і можна відшукати такий план X, для якого виконуватиметься нерівність <sub><img src="/img/image473.gif"></sub>.</i></p>
<p><b><i>Теорема 5.2.2.</i> </b><i>Якщо для деякого вектора <sub><img src="/img/image460.gif"></sub> виконується умова <sub><img src="/img/image475.gif"></sub>, то план <sub><img src="/img/image450.gif"></sub> не є оптимальним і можна відшукати такий план X, для якого виконуватиметься нерівність <sub><img src="/img/image477.gif"></sub>.</i></p>
<p><b>5.3. Розв’язування задачі лінійного програмування симплексним методом</b></p>
<p>Розглянемо, як виходячи з початкового опорного плану задачі лінійного програмування, за допомогою симплексного методу знайти оптимальний план.</p>
<p>Продовжимо розгляд задачі (5.1.1)-(5.1.3), опорний план якої має вигляд (5.1.5). для дослідження даного плану на оптимальність (за умовою оптимальності плану задачі лінійного програмування) необхідно вектори <sub><img src="/img/image460.gif"></sub><sub><img src="/img/image464.gif"></sub> системи обмежень (5.1.2) розкласти за базисними векторами <sub><img src="/img/image438.gif"></sub> і розрахувати значення оцінок <sub><img src="/img/image462.gif"></sub>.</p>
<p>Всі подальші обчислення зручно проводити в <b><i>симплексній таблиці</i></b> (табл. 5.3.1).</p>
<p>Таблиця 5.3.1.</p>
<table border=1>
<tr>
<td rowspan=2> <i></i></p>
<p><i>i</i></td>
<td rowspan=2></p>
<p>Базис</td>
<td rowspan=2></p>
<p><sub><img src="/img/image479.gif"></sub></td>
<td rowspan=2></p>
<p>План</td>
<td><sub><img src="/img/image481.gif"></sub></td>
<td>…</td>
<td><sub><img src="/img/image483.gif"></sub></td>
<td><sub><img src="/img/image485.gif"></sub></td>
<td>…</td>
<td><sub><img src="/img/image487.gif"></sub></td>
<td>…</td>
<td><sub><img src="/img/image489.gif"></sub></td>
<td rowspan=2></p>
<p><sub><img src="/img/image491.gif"></sub></td>
</tr>
<tr>
<td><sub><img src="/img/image083.gif"></sub></td>
<td>…</td>
<td><sub><img src="/img/image494.gif"></sub></td>
<td><sub><img src="/img/image496.gif"></sub></td>
<td>…</td>
<td><sub><img src="/img/image498.gif"></sub></td>
<td>…</td>
<td><sub><img src="/img/image500.gif"></sub></td>
</tr>
<tr>
<td>1</td>
<td><sub><img src="/img/image083.gif"></sub></td>
<td><sub><img src="/img/image481.gif"></sub></td>
<td><sub><img src="/img/image503.gif"></sub></td>
<td>1</td>
<td>…</td>
<td>0</td>
<td><sub><img src="/img/image505.gif"></sub></td>
<td>…</td>
<td><sub><img src="/img/image507.gif"></sub></td>
<td>…</td>
<td><sub><img src="/img/image509.gif"></sub></td>
<td><sub><img src="/img/image511.gif"></sub></td>
</tr>
<tr>
<td>…</td>
<td>…</td>
<td>…</td>
<td>…</td>
<td>…</td>
<td>…</td>
<td>…</td>
<td>…</td>
<td>…</td>
<td>…</td>
<td>…</td>
<td>…</td>
<td>…</td>
</tr>
<tr>
<td><i>l</i></td>
<td><sub><img src="/img/image513.gif"></sub></td>
<td><sub><img src="/img/image515.gif"></sub></td>
<td><sub><img src="/img/image517.gif"></sub></td>
<td>0</td>
<td>…</td>
<td>0</td>
<td><sub><img src="/img/image519.gif"></sub></td>
<td>…</td>
<td><sub><img src="/img/image521.gif"></sub></td>
<td>…</td>
<td><sub><img src="/img/image523.gif"></sub></td>
<td><sub><img src="/img/image525.gif"></sub></td>
</tr>
<tr>
<td>...</td>
<td>…</td>
<td>…</td>
<td>…</td>
<td>…</td>
<td>…</td>
<td>…</td>
<td>…</td>
<td>…</td>
<td>…</td>
<td>…</td>
<td>…</td>
<td>…</td>
</tr>
<tr>
<td><i>m</i></td>
<td><sub><img src="/img/image494.gif"></sub></td>
<td><sub><img src="/img/image483.gif"></sub></td>
<td><sub><img src="/img/image528.gif"></sub></td>
<td>0</td>
<td>…</td>
<td>1</td>
<td><sub><img src="/img/image530.gif"></sub></td>
<td>…</td>
<td><sub><img src="/img/image532.gif"></sub></td>
<td>…</td>
<td><sub><img src="/img/image534.gif"></sub></td>
<td><sub><img src="/img/image536.gif"></sub></td>
</tr>
<tr>
<td><i>m+1</i></td>
<td colspan=2><sub><img src="/img/image538.gif"></sub></td>
<td><sub><img src="/img/image540.gif"></sub></td>
<td>0</td>
<td>…</td>
<td>0</td>
<td><sub><img src="/img/image542.gif"></sub></td>
<td>…</td>
<td><sub><img src="/img/image544.gif"></sub></td>
<td>…</td>
<td><sub><img src="/img/image546.gif"></sub></td>
<td> </td>
</tr>
</table>
<p></p>
<p>У стовпці «Базис» записані змінні, що відповідають базисним векторам, а в стовпці «<sub><img src="/img/image479.gif"></sub>» - коефіцієнти функціонала відповідних базисних векторів. У стовпці «План» - початковий опорний план <sub><img src="/img/image450.gif"></sub>, в цьому ж стовпці в результаті обчислень отримують оптимальний план. У <i>(m+1)</i>-му рядку в стовпці «План» записують значення функціонала для початкового опорного плану <sub><img src="/img/image540.gif"></sub>, а в інших стовпцях <sub><img src="/img/image276.gif"></sub> - значення оцінок <sub><img src="/img/image462.gif"></sub>. Цей рядок симплексної таблиці називають <b><i>оцінковим</i></b>.</p>
<p>Значення <sub><img src="/img/image540.gif"></sub> знаходять підстановкою компонент опорного плану в цільову функцію, а значення <sub><img src="/img/image552.gif"></sub> - при підстановці коефіцієнтів розкладу кожного <sub><img src="/img/image201.gif"></sub>-го вектора за векторами базису, тобто ці значення в табл. 5.3.1 отримують як скалярний добуток:</p>
<p><sub><img src="/img/image555.gif"></sub></p>
<p><sub><img src="/img/image557.gif"></sub>,</p>
<p>де <sub><img src="/img/image559.gif"></sub> - коефіцієнти функціонала, що відповідають векторам базису.</p>
<p>Після заповнення табл. 5.3.1 розраховують значення оцінок плану (останній рядок): <sub><img src="/img/image561.gif"></sub></p>
<p>Потім згідно з умовою оптимальності плану задачі лінійного програмування, якщо всі <sub><img src="/img/image467.gif"></sub> (для задачі на максимум), то план є оптимальним. Допустимо, що одна з оцінок <sub><img src="/img/image563.gif"></sub>, тоді план <sub><img src="/img/image450.gif"></sub> не є оптимальним і необхідно здійснити перехід до наступного опорного плану, якому буде відповідати більше значення функціонала. Якщо від’ємних оцінок кілька, то включенню до базису підлягає вектор, який вибирається як <sub><img src="/img/image566.gif"></sub>. Мінімум знаходять для тих індексів <sub><img src="/img/image201.gif"></sub>, де <sub><img src="/img/image563.gif"></sub>. Якщо існує кілька однакових значень оцінок, що відповідають <sub><img src="/img/image566.gif"></sub>, то з відповідних їм векторів до базису включають той, якому відповідає максимальне значення функціоналу.</p>
<p>Якщо хоча б для однієї від’ємної оцінки <sub><img src="/img/image563.gif"></sub> всі коефіцієнти розкладу <sub><img src="/img/image568.gif"></sub> відповідного вектора недодатні, то це означає, що функціонал є необмеженим на багатограннику розв’язків, тобто багатогранник у даному разі являє собою необмежену область і розв’язком задачі є <sub><img src="/img/image570.gif"></sub>.</p>
<p>Нехай <sub><img src="/img/image572.gif"></sub>, тобто мінімальне значення досягається для <i>k</i>-го вектора <sub><img src="/img/image574.gif"></sub>. Тоді до базису включається вектор <sub><img src="/img/image576.gif"></sub>. Відповідний стовпчик симплексної таблиці називають <b><i>напрямним.</i></b></p>
<p>Для того, щоб вибрати вектор, який необхідно вивести з базису ( згідно з процедурою переходу від одного опорного плану задачі до іншого), розраховують останній стовпчик табл. 5.3.1 – значення <sub><img src="/img/image491.gif"></sub>.</p>
<p><sub><img src="/img/image578.gif"></sub></p>
<p>З розрахованих значень необхідно вибрати найменше <sub><img src="/img/image580.gif"></sub>.Тоді з базису виключають <i>і</i>-ий вектор, якому відповідає <sub><img src="/img/image582.gif"></sub>.</p>
<p>Допустимо, що <sub><img src="/img/image584.gif"></sub> відповідає вектору, що знаходиться в <i>l</i>-му рядку табл. 5.3.1. Відповідний рядок симплексної таблиці називають <b><i>напрямним.</i></b></p>
<p>Перетином напрямного стовпчика та напрямного рядка визначається елемент симплексної таблиці <sub><img src="/img/image521.gif"></sub>, який називають <b><i>розв’язувальним елементом.</i></b> За допомогою елемента <sub><img src="/img/image521.gif"></sub> і метода Жордана-Гаусса розраховують нову симплексну таблицю, що визначатиме наступний опорний план задачі.</p>
</div>
