<div id="main-midle">
	<h1>Глава №6</h1>
	<h2>Транспортна задача лінійного програмування</h2>
<p>Транспортна задача є типовою задачею лінійного програмування, отже, її розв'язок можна отримати звичайним симплексним методом. Однак, у деяких випадках застосування універсальних алгоритмів є нераціональним. Специфічна структура транспортної задачі дає змогу отримати альтернативний метод відшукання оптимального плану у вигляді простішої у порівнянні з симплексним методом обчислювальної процедури. Транспортна задача належить до типу розподільчих задач лінійного програмування. Економічний зміст таких задач може стосуватися різноманітних проблем, що переважно зовсім не пов'язано із перевезенням вантажів, як, наприклад, задачі оптимального розміщення виробництва, складів, оптимального призначення тощо.</p>
<p><b>7.1. Економічна і математична постановки транспортної задачі</b></p>
<p> <b></b></p>
<p>Класична транспортна задача лінійного програмування формулюється так: деякий однорідний продукт, що знаходиться у m постачальників А<sub><img src="/img/image772.gif"></sub> в обсягах <sub><img src="/img/image774.gif"></sub>,<sub><img src="/img/image776.gif"></sub>,…,<sub><img src="/img/image778.gif"></sub> одиниць відповідно необхідно перевезти n споживачам <sub><img src="/img/image780.gif"></sub> в обсягах <sub><img src="/img/image782.gif"></sub>,<sub><img src="/img/image784.gif"></sub>,…,<sub><img src="/img/image786.gif"></sub> одиниць. При цьому виконується умова, що загальний наявний обсяг продукції у постачальників дорівнює загальному попиту всіх споживачів. Відомі вартості <sub><img src="/img/image788.gif"></sub> перевезень одиниці продукції від кожного <sub><img src="/img/image790.gif"></sub>-го постачальника до кожного <sub><img src="/img/image780.gif"></sub>-го споживача, що подані як елементи матриці виду: <sub><img src="/img/image788.gif"></sub>= <sub><img src="/img/image793.gif"></sub>.</p>
<p> Необхідно визначити план перевезень, за якого вся продукція була б вивезена від постачальників, повністю задоволені потреби споживачів і загальна вартість всіх перевезень була б мінімальною.</p>
<p>У такій постановці задачі ефективність плану перевезень визначається його вартістю і така задача має назву <b><i>транспортної задачі за критерієм вартості перевезень.</i></b></p>
<p>Запишемо її математичну модель. Позначимо через <sub><img src="/img/image795.gif"></sub> обсяг продукції, що перевозиться від <sub><img src="/img/image790.gif"></sub> постачальника до <sub><img src="/img/image780.gif"></sub> споживача (<sub><img src="/img/image797.gif"></sub>;<sub><img src="/img/image799.gif"></sub>). Тоді умови задачі зручно подати у вигляді такої таблиці:</p>
<p>Таблиця 7.1.</p>
<table border=1>
<tr>
<td colspan=2 rowspan=2></p>
<p>Споживачі</p>
<p>Постачальники</td>
<td> <sub><img src="/img/image801.gif"></sub></td>
<td> <sub><img src="/img/image803.gif"></sub></td>
<td> …</td>
<td> <sub><img src="/img/image805.gif"></sub></td>
</tr>
<tr>
<td> <sub><img src="/img/image782.gif"></sub> <sub><img src="/img/image808.gif"></sub></td>
<td> <sub><img src="/img/image784.gif"></sub></td>
<td> …</td>
<td> <sub><img src="/img/image786.gif"></sub></td>
</tr>
<tr>
<td> <sub><img src="/img/image812.gif"></sub></td>
<td> <sub><img src="/img/image774.gif"></sub></td>
<td><sub><img src="/img/image815.gif"></sub> <sub><img src="/img/image817.gif"></sub></td>
<td><sub><img src="/img/image819.gif"></sub> <sub><img src="/img/image821.gif"></sub></td>
<td> …</td>
<td><sub><img src="/img/image823.gif"></sub> <sub><img src="/img/image825.gif"></sub></td>
</tr>
<tr>
<td> <sub><img src="/img/image827.gif"></sub></td>
<td> <sub><img src="/img/image776.gif"></sub></td>
<td><sub><img src="/img/image830.gif"></sub> <sub><img src="/img/image832.gif"></sub></td>
<td><sub><img src="/img/image834.gif"></sub> <sub><img src="/img/image808.gif"></sub><sub><img src="/img/image836.gif"></sub></td>
<td> …</td>
<td><sub><img src="/img/image830.gif"></sub> <sub><img src="/img/image839.gif"></sub></td>
</tr>
<tr>
<td> …</td>
<td> …</td>
<td> …</td>
<td> …</td>
<td> …</td>
<td> …</td>
</tr>
<tr>
<td> <sub><img src="/img/image841.gif"></sub></td>
<td> <sub><img src="/img/image778.gif"></sub></td>
<td><sub><img src="/img/image844.gif"></sub> <sub><img src="/img/image846.gif"></sub></td>
<td><sub><img src="/img/image848.gif"></sub> <sub><img src="/img/image850.gif"></sub></td>
<td> …</td>
<td><sub><img src="/img/image852.gif"></sub> <sub><img src="/img/image854.gif"></sub></td>
</tr>
</table>
<p></p>
<p>Мають виконуватися такі умови:</p>
<p>1) сумарний обсяг продукції, що вивозиться з кожного <sub><img src="/img/image856.gif"></sub>-го пункту, має дорівнювати запасу продукції в даному пункті:</p>
<p><sub><img src="/img/image858.gif"></sub></p>
<p>2) сумарний обсяг продукції, що ввезений кожному <sub><img src="/img/image860.gif"></sub>-му споживачеві, має дорівнювати його потребам:</p>
<p><sub><img src="/img/image862.gif"></sub></p>
<p>3) сумарна вартість всіх перевезень повинна бути мінімальною:</p>
<p><sub><img src="/img/image864.gif"></sub>Очевидно, що <sub><img src="/img/image866.gif"></sub>.</p>
<p>У скороченій формі запису математична модель транспортної задачі за критерієм вартості перевезень має такий вигляд:</p>
<p> <sub><img src="/img/image868.gif"></sub>  (7.1)</p>
<p>за обмежень:</p>
<p> <sub><img src="/img/image870.gif"></sub>;  (7.2)</p>
<p>  <sub><img src="/img/image872.gif"></sub>;  (7.3)</p>
<p> <sub><img src="/img/image874.gif"></sub> ( <sub><img src="/img/image797.gif"></sub>; <sub><img src="/img/image799.gif"></sub>).  (7.4)</p>
<p>У розглянутій задачі має виконуватися умова:</p>
<p> <sub><img src="/img/image878.gif"></sub>.  (7.5)</p>
<p>Транспортну задачу називають <b><i>збалансованою</i></b>, або <b><i>закритою</i></b>, якщо виконується умова (7.5). Якщо ж така умова не виконується, то транспортну задачу називають <b><i>незбалансованою</i></b>, або <b><i>відкритою</i></b>.</p>
<p><b><i>Планом</i></b> транспортної задачі називають будь-який невід'ємний розв'язок системи обмежень (7.2)—(7.4), який позначають матрицею <sub><img src="/img/image880.gif"></sub> (<sub><img src="/img/image882.gif"></sub>). Значення невідомих величин <sub><img src="/img/image795.gif"></sub>- обсяги продукції, що мають бути перевезені від <sub><img src="/img/image856.gif"></sub>-х постачальників до <sub><img src="/img/image860.gif"></sub>-х споживачів, називатимемо <b><i>перевезеннями</i></b>.</p>
<p><b><i>Оптимальним планом</i></b> транспортної задачі називають матрицю <sub><img src="/img/image885.gif"></sub> (<sub><img src="/img/image887.gif"></sub>), яка задовольняє умови задачі, і для якої цільова функція (7.1) набирає найменшого значення.</p>
<p><b><i>Теорема (умова існування розв'язку транспортної задачі)</i></b>: <i>необхідною і достатньою умовою існування розв'язку транспортної задачі(7.1)—(7.4) є її збалансованість: <sub><img src="/img/image889.gif"></sub>.</i></p>
<p><b><i>Доведення.</i></b> <i>Необхідність</i>. Нехай задача (7.1)—(7.4) має розв'язок <sub><img src="/img/image891.gif"></sub>, тоді для нього виконуються рівняння-обмеження (7.2) і (7.3). Підсумуємо відповідно ліві та праві частини систем рівнянь (7.2) і (7.3). Матимемо:</p>
<p> <sub><img src="/img/image893.gif"></sub>,  (7.6)</p>
<p> <sub><img src="/img/image895.gif"></sub>.   (7.7)</p>
<p>Оскільки ліві частини рівнянь (7.6) та (7.7) збігаються, то праві також рівні одна одній, отже, виконується умова:</p>
<p> <sub><img src="/img/image889.gif"></sub>.  (7.8)</p>
<p><i>Достатність</i>. Потрібно показати, що за заданої умови (7.8) існує хоча б один план задачі, і цільова функція на множині планів обмежена.</p>
<p>Нехай <sub><img src="/img/image897.gif"></sub>. Розглянемо величину <sub><img src="/img/image899.gif"></sub> (<sub><img src="/img/image887.gif"></sub>). Підставивши значення <sub><img src="/img/image795.gif"></sub> в систему обмежень задачі (7.1)-(7.4), матимемо:</p>
<p><sub><img src="/img/image901.gif"></sub>;</p>
<p><sub><img src="/img/image903.gif"></sub>.</p>
<p>Оскільки умови (7.2) та (7.3) виконуються, то <sub><img src="/img/image899.gif"></sub> (<sub><img src="/img/image887.gif"></sub>) є планом наведеної транспортної задачі.</p>
<p>Виберемо з елементів <sub><img src="/img/image788.gif"></sub> (<sub><img src="/img/image887.gif"></sub>) найбільше значення і позначимо його через <sub><img src="/img/image906.gif"></sub>. Якщо замінити в цільовій функції (7.1) всі коефіцієнти на <sub><img src="/img/image908.gif"></sub>, то, враховуючи (7.2), матимемо: <sub><img src="/img/image910.gif"></sub>.</p>
<p>Виберемо з елементів <sub><img src="/img/image788.gif"></sub> (<sub><img src="/img/image887.gif"></sub>) найменше значення і позначимо його через <sub><img src="/img/image912.gif"></sub>. Якщо замінити в цільовій функції (7.1) всі коефіцієнти на <sub><img src="/img/image914.gif"></sub>, то, враховуючи (7.2), матимемо: <sub><img src="/img/image916.gif"></sub>.</p>
<p>Тобто цільова функція на множині допустимих планів транспортної задачі є обмеженою: <sub><img src="/img/image918.gif"></sub>. Теорему доведено.</p>
<p>Якщо при перевірці збалансованості (7.5) виявилося, що транспортна задача є відкритою, то її необхідно звести до закритого типу. Це здійснюється введенням фіктивного (умовного) постачальника <sub><img src="/img/image920.gif"></sub> у разі перевищення загального попиту над запасами (<sub><img src="/img/image922.gif"></sub>), із ресурсом обсягом <sub><img src="/img/image924.gif"></sub>. Якщо ж загальні запаси постачальників перевищують попит споживачів (<sub><img src="/img/image926.gif"></sub>), то до закритого типу задача зводиться введенняь фіктивного (умовного) споживача <sub><img src="/img/image928.gif"></sub> з потребою <sub><img src="/img/image930.gif"></sub>.</p>
<p>Вартість перевезення одиниці продукції від фіктивного постачальника <sub><img src="/img/image920.gif"></sub> (або фіктивного споживача <sub><img src="/img/image933.gif"></sub>) до кожного зі споживачів (виробників) має дорівнювати нулю або бути набагато більшою за реальні витрати <sub><img src="/img/image788.gif"></sub>(<sub><img src="/img/image887.gif"></sub>). Як правило, у такому разі використовують нульові значення вартостей перевезень, що дає змогу спростити обчислення.</p>
<p>Як згадувалося вище, транспортна задача (7.1)-(7.4) є звичайною задачею лінійного програмування і може бути розв'язана симплексним методом, однак особливості побудови математичної моделі транспортної задачі дають змогу розв'язати її простіше. Легко помітити, що всі коефіцієнти при змінних у рівняннях (7.2), (7.3) дорівнюють одиниці, а сама система обмежень (7.2), (7..3) задана в канонічній формі. Крім того, система обмежень (7.2), (7.3) складається з <i>mn</i> невідомих та <i>m+n</i> рівнянь, які пов'язані між собою співвідношенням (7.8). Якщо додати відповідно праві та ліві частини систем рівнянь (7.2) та (7.3), то отримаємо два однакових рівняння:</p>
<p><sub><img src="/img/image935.gif"></sub>;</p>
<p><sub><img src="/img/image937.gif"></sub>.</p>
<p>Наявність у системі обмежень двох однакових рівнянь свідчить про її лінійну залежність. Якщо одне з цих рівнянь відкинути, то в загальному випадку система обмежень буде містити <sub><img src="/img/image939.gif"></sub> лінійно незалежне рівняння, отже, їх можна розв'язати відносно <sub><img src="/img/image939.gif"></sub> базисних змінних. Назвемо <b><i>опорним планом</i></b> транспортної задачі такий допустимий її план, що містить не більш ніж <sub><img src="/img/image939.gif"></sub> додатних компонент, а всі інші його компоненти дорівнюють нулю. Такий план є невиродженим. Якщо ж кількість базисних змінних менша ніж <sub><img src="/img/image939.gif"></sub>, то маємо вироджений опорний план.</p>
<p><b>7.2. Методи побудови опорного плану транспортної задачі</b></p>
<p>Як і в звичайному симплексному методі, розв'язування транспортної задачі полягає в цілеспрямованому переборі та перевірці на оптимальність опорних планів. Початком такого ітераційного процесу є побудова першого опорного плану.</p>
<p>Розглянемо методи північно-західного кута, мінімальної вартості, подвійної переваги та метод апроксимації Фотеля. Побудову опорного плану зручно подавати у вигляді таблиці, в якій постачальники продукції відповідають рядкам, а споживачі-стовпчикам.</p>
<p>Нехай умови конкретної транспортної задачі подані в табл. 7.2.1.</p>
<p>Таблиця 7.2.1.</p>
<table border=1>
<tr>
<td rowspan=2></p>
<p>Постачальник</td>
<td colspan=4>Споживач</td>
<td rowspan=2></p>
<p>Запаси вантажу</td>
</tr>
<tr>
<td><i>В<sub>1</sub></i></td>
<td><i>В<sub>2</sub></i></td>
<td><i>В<sub>3</sub></i></td>
<td><i>В<sub>4</sub></i></td>
</tr>
<tr>
<td></p>
<p><i>А<sub>1</sub></i></td>
<td></p>
<p><i>4</i></td>
<td> <i></i></p>
<p><i>4</i></td>
<td> <i></i></p>
<p><i>2</i></td>
<td> <i></i></p>
<p><i>5</i></td>
<td> <i></i></p>
<p><i>150</i></td>
</tr>
<tr>
<td></p>
<p><i>А<sub>2</sub></i></td>
<td> <i></i></p>
<p><i>5</i></td>
<td> <i></i></p>
<p><i>3</i></td>
<td> <i></i></p>
<p><i>1</i></td>
<td> <i></i></p>
<p><i>2</i></td>
<td> <i></i></p>
<p><i>60</i></td>
</tr>
<tr>
<td></p>
<p><i>А<sub>3</sub></i></td>
<td> <i></i></p>
<p><i>2</i></td>
<td> <i></i></p>
<p><i>1</i></td>
<td> <i></i></p>
<p><i>4</i></td>
<td> <i></i></p>
<p><i>2</i></td>
<td> <i></i></p>
<p><i>90</i></td>
</tr>
<tr>
<td>Потреба</td>
<td><i>110</i></td>
<td><i>50</i></td>
<td><i>60</i></td>
<td><i>80</i></td>
<td> </td>
</tr>
</table>
<p></p>
<p><i>Ідея методу <b>північно-західного кута</b> полягає в тому, що заповнення таблиці починають не враховуючи вартостей перевезень, з лівого верхнього (північно-західного) кута</i>. У клітину записують менше з двох чисел <sub><img src="/img/image774.gif"></sub> та <sub><img src="/img/image782.gif"></sub>. Далі переходять до наступної клітини в цьому ж рядку або у стовпчику і заповнюють її, і т.д. Закінчують заповнення таблиці у правій нижній клітинці. У такий спосіб значення поставок будуть розташовані по діагоналі таблиці.</p>
<p>Розглянемо цей процес детальніше на прикладі.</p>
<p>Спочатку, не враховуючи вартості перевезень, завжди задовольняють потреби першого споживача <sub><img src="/img/image801.gif"></sub>, використовуючи запаси першого постачальника <sub><img src="/img/image812.gif"></sub>. У нашому прикладі (табл. 7.2.1) потреби споживача<sub><img src="/img/image801.gif"></sub> становлять <sub><img src="/img/image945.gif"></sub>, а запаси постачальника - <sub><img src="/img/image947.gif"></sub> одиниць (тобто із запасів першого постачальника можна повністю задовольнити потреби першого споживача), тому в клітину <sub><img src="/img/image812.gif"></sub><sub><img src="/img/image801.gif"></sub> записуємо менше із значень <sub><img src="/img/image949.gif"></sub>, тобто 110. Тепер потреби першого споживача повністю задоволені, і переходимо до задоволення потреб наступного (другого) споживача <sub><img src="/img/image803.gif"></sub>. Обсяг Його потреб <sub><img src="/img/image952.gif"></sub>. Після задоволення потреб першого споживача залишок запасів першого постачальника становить <sub><img src="/img/image954.gif"></sub>. Отже, від першого виробника другому споживачеві можна перевезти лише 40 одиниць продукції, тому в клітину <sub><img src="/img/image812.gif"></sub><sub><img src="/img/image803.gif"></sub> записуємо число 40. Після цього, оскільки запаси першого постачальника повністю вичерпані, переходимо до використання запасів наступного постачальника <sub><img src="/img/image827.gif"></sub>. Його запаси <sub><img src="/img/image958.gif"></sub>, а незадоволені потреби другого споживача <sub><img src="/img/image960.gif"></sub>, тому в клітинку<sub><img src="/img/image827.gif"></sub><sub><img src="/img/image803.gif"></sub>   записуємо число <sub><img src="/img/image962.gif"></sub>, і другий споживач у такий спосіб також повністю отримав необхідну кількість продукції. Переходимо до задоволення потреб наступного споживача <sub><img src="/img/image964.gif"></sub>. У результаті часткового використання запасів другого постачальника його залишок продукції становить <sub><img src="/img/image966.gif"></sub>. Отже, від другого виробника до третього споживача можна перевезти <sub><img src="/img/image968.gif"></sub> одиниць продукції. Клітинка  <sub><img src="/img/image827.gif"></sub><sub><img src="/img/image964.gif"></sub> міститиме зазначене число <sub><img src="/img/image968.gif"></sub>, і цим запаси постачальника  <sub><img src="/img/image827.gif"></sub> будуть повністю вичерпані. Переходимо до розподілу запасів останнього (третього) постачальника <sub><img src="/img/image970.gif"></sub>. Залишились незадоволеними потреби третього споживача в обсязі <sub><img src="/img/image972.gif"></sub>. Для їх задоволення скористаємося запасами постачальника<sub><img src="/img/image970.gif"></sub> . У клітинку <sub><img src="/img/image970.gif"></sub><sub><img src="/img/image964.gif"></sub>, записуємо число <sub><img src="/img/image962.gif"></sub>, і потреби споживача <sub><img src="/img/image964.gif"></sub> також повністю задоволені. Переходимо до останнього споживача <sub><img src="/img/image976.gif"></sub>, з потребами <sub><img src="/img/image978.gif"></sub>, які повністю задовольняються за рахунок залишку запасів третього постачальника: <sub><img src="/img/image980.gif"></sub>.</p>
<p>Таблиця 7.2.2</p>
<p><img src="/img/image982.jpg"></p>
<p>Отже, в таблиці 7.2.2 у заповнених клітинках знаходяться числа, що означають можливий план перевезень продукції. Сума чисел (перевезень) по рядках дорівнює обсягам запасів постачальників, а сума чисел по стовпцях — обсягам потреб відповідних споживачів.</p>
<p>Аналогічний результат можна отримати, якщо почати з правого нижнього кута таблиці, рухаючись до лівого верхнього. Процедуру методу можна застосовувати також, починаючи розподіл поставок з лівого нижнього кута і рухаючись до правого верхнього по діагоналі. В такому разі спосіб розподілу перевезень можна було б назвати методом південно-західного кута, тому цей метод ще називають діагональним. Метод північно-західного кута є найпростішим, однак і найменш ефективним. Процес відшукання оптимального плану після початкового опорного, визначеного методом північно-західного кута, пов'язаний зі значним обсягом обчислювальних робіт, тому його реалізують на ЕОМ.</p>
<p>Визначимо загальну вартість перевезень згідно з початковим опорним планом. Від першого постачальника до першого споживача необхідно перевезти 110 одиниць продукції за ціною 4 ум. од. (ціна записана в правому верхньому куті кожної клітини), отже коштуватиме <sub><img src="/img/image984.gif"></sub> ум. од. Крім того, необхідно пе­ревезти від першого постачальника 40 одиниць продукції до другого споживача за ціною 4 ум. од. і т. д. У такий спосіб визначимо загальну вартість усіх перевезень: <sub><img src="/img/image986.gif"></sub> (ум. од.).</p>
<p>Якщо за побудови опорного плану враховувати вартості перевезень, то сумарна вартість всіх постачань може бути зменшена, і отриманий опорний план буде ближчим до оптимального.</p>
<p><i>Ідея <b>методу мінімальної вартості</b> полягає в тому, що на кожному кроці заповнюють клітинку таблиці, яка має найменшу вартість перевезення одиниці продукції. Такі дії повторюють доти, доки не буде розподілено всю продукцію між постачальниками та споживачами.</i></p>
<p>Складемо за допомогою цього методу план розглянутої задачі (табл. 7.2.3).</p>
<p>Найменшу вартість мають перевезення, які здійснюються від <sub><img src="/img/image827.gif"></sub> до <sub><img src="/img/image964.gif"></sub> та від <sub><img src="/img/image970.gif"></sub>  до <sub><img src="/img/image803.gif"></sub> (ціна перевезення одиниці продукції – 1 ум. од.). Заповнимо будь-яку з них, наприклад, <sub><img src="/img/image991.gif"></sub>. Оскільки постачальник має 60 одиниць продукції, а споживач потребує саме такої її кількості, то в клітину <sub><img src="/img/image991.gif"></sub> ставимо значення 60. У такий спосіб запаси другого постачальника повністю вичерпані, а потреби третього споживача повністю задоволені. Також мінімальною є вартість перевезень від третього постачальника до другого споживача, тому заповнимо також клітину <sub><img src="/img/image994.gif"></sub>.</p>
<p>З клітинок таблиці, що залишились незаповненими, вибираємо наступне мінімальне значення вартості перевезень, яке дорівнює 2 ум.од. - для клітин <sub><img src="/img/image996.gif"></sub>, <sub><img src="/img/image998.gif"></sub>, <sub><img src="/img/image1000.gif"></sub> та <sub><img src="/img/image1002.gif"></sub>.</p>
<p> Заповнення клітин <sub><img src="/img/image998.gif"></sub> та <sub><img src="/img/image996.gif"></sub> неможливе, оскільки постачальник А<sub>2</sub> вже повністю вичерпав власний обсяг запасів, задовольняючи потреби споживача<sub><img src="/img/image964.gif"></sub> , а споживач <sub><img src="/img/image964.gif"></sub>, повністю задовольнив свої потреби. Отже, можна заповнити тільки клітину <sub><img src="/img/image1000.gif"></sub> чи <sub><img src="/img/image1002.gif"></sub>. Заповнимо <sub><img src="/img/image1000.gif"></sub>. Обсяг запасів <sub><img src="/img/image1006.gif"></sub>, причому 50 одиниць продукції вже надано другому споживачеві. Отже, маємо залишок <sub><img src="/img/image1008.gif"></sub>, а потреби <sub><img src="/img/image945.gif"></sub>, тому від третього постачальника до першого споживача плануємо перевезти 40 одиниць продукції. Тепер у клітину <sub><img src="/img/image1002.gif"></sub> неможна записати будь-який обсяг постачання, оскільки запаси третього постачальника вже повністю вичерпані.</p>
<p>Знову вибираємо найменшу вартість для клітин таблиці, що залишилися пустими, і продовжуємо процес доти, поки всі запаси не будуть розподілені, а потреби — задоволені.</p>
<p>В результаті таких міркувань отримали початковий опорний план, загальна  вартість перевезень для якого становить:</p>
<p><sub><img src="/img/image1011.gif"></sub> (ум. од.).</p>
<p>Значення цільової функції менше за попередній варіант, значить цей план ближчий до оптимального.</p>
<p> Таблиця 7.2.3.</p>
<table border=1>
<tr>
<td>  <sub><img src="/img/image1013.gif"></sub></p>
<p><sub><img src="/img/image1015.gif"></sub></td>
<td> <sub><img src="/img/image945.gif"></sub></td>
<td> <sub><img src="/img/image952.gif"></sub></td>
<td> <sub><img src="/img/image1019.gif"></sub></td>
<td> <sub><img src="/img/image978.gif"></sub></td>
</tr>
<tr>
<td> <sub><img src="/img/image947.gif"></sub></td>
<td> 4</p>
<p>  70</td>
<td> 4</td>
<td> 2</td>
<td> 5</p>
<p> 80</td>
</tr>
<tr>
<td> <sub><img src="/img/image958.gif"></sub></td>
<td> 5</p>
<p> </td>
<td> 3</td>
<td> 1</p>
<p>  60</td>
<td>  2</td>
</tr>
<tr>
<td> <sub><img src="/img/image1006.gif"></sub></td>
<td> 2</p>
<p> 40 </td>
<td> 1</p>
<p> 50</td>
<td> 4</td>
<td> 2</td>
</tr>
</table>
<p><b><i>Метод подвійної переваги</i></b>. Якщо розмірність задачі досить велика, то перебір за методом мінімальної вартості ускладнюється. В такому разі спростити пошук клітин з найменшими вартостями можна, застосовуючи метод подвійної переваги.</p>
<p>Згідно з процедурою цього методу перед початком заповнення таблиці необхідно позначити будь-якими символами клітинки, які містять найменшу вартість у рядках, а потім — у стовпчиках. Таблицю починають заповнювати з клітинок, позначених двічі (які містять вартості, що є мінімальними і в рядку, і в стовпчику). Далі заповнюють клітинки, позначені один раз (що містять мінімальні вартості або в рядку, або в стовпчику), а вже потім — за методом мінімальної вартості.</p>
<p>Таблиця 7.2.4</p>
<table border=1>
<tr>
<td> <sub><img src="/img/image1013.gif"></sub></p>
<p><sub><img src="/img/image1015.gif"></sub></td>
<td></p>
<p> <sub><img src="/img/image945.gif"></sub></td>
<td></p>
<p> <sub><img src="/img/image952.gif"></sub></td>
<td></p>
<p> <sub><img src="/img/image1019.gif"></sub></td>
<td></p>
<p> <sub><img src="/img/image978.gif"></sub></td>
</tr>
<tr>
<td></p>
<p> <sub><img src="/img/image947.gif"></sub></td>
<td> 4</p>
<p> 110</td>
<td> 4</td>
<td> V 2</td>
<td> 5</p>
<p> 40</td>
</tr>
<tr>
<td></p>
<p> <sub><img src="/img/image958.gif"></sub></td>
<td>  5</p>
<p> </td>
<td> 3</td>
<td>  VV  1</p>
<p> 60</td>
<td>  V 2</td>
</tr>
<tr>
<td></p>
<p> <sub><img src="/img/image1006.gif"></sub></td>
<td> V 2</p>
<p> </td>
<td> VV 1</p>
<p> 50</td>
<td> 4</td>
<td>   V 2</td>
</tr>
</table>
<p></p>
<p><sub><img src="/img/image1025.gif"></sub> (ум.од.).</p>
<p>Застосування для побудови опорного плану даного методу уможливлює отримання найменшого у зіставленні з розглянутими вище значення цільової функції. Отже, такий план є найближчим до оптимального.</p>
<p><b><i>Метод апроксимації Фогеля.</i></b> За цим методом на кожному кроці визначають різницю між двома найменшими вартостями в кожному рядку і стовпчику транспортної таблиці. Ці різниці записують у спеціально відведених місцях таблиці — знизу та справа у кілька рядків та стовпчиків, що відповідають крокам заповнення таблиці. З-поміж усіх різниць вибирають найбільшу і у відповідному рядку чи стовпчику заповнюють клітинку з найменшою вартістю. Якщо ж однакових найбільших різниць кілька, то вибирають будь-який відповідний рядок або стовпчик. Коли залишається незаповненим лише один рядок або стовпчик, то обчислення різниць припиняють, а таблицю продовжують заповнювати за методом мінімальної вартості.</p>
<p>Даний метод побудови опорного плану враховує не лише маршрути з мінімальними витратами перевезень продукції, але й співвідношення витрат у рядку чи стовпчику, тобто розраховується наскільки, може збільшитися вартість постачання на наступних кроках процедури, якщо не здійснити на поточному кроці постачання в клітину з мінімальною вартістю.</p>
<p>Метод апроксимації Фогеля дає змогу особливо для задач великих розмірностей скласти найкращий опорний план.</p>
<p>У таблиці 7.2.5 напроти кожного рядка і стовпчика записані величини, які знайдені як різниці між мінімальним значенням вартості та наступним за ним по рівню. Максимальне значення такої різниці на першому кроці відповідає четвертому стовпчику і означає, що у разі, коли не буде задоволена потреба четвертого споживача перевезенням продукції від третього постачальника за ціною 2 ум. од. за одиницю, то на наступних кроках вартість перевезення може бути на 3 ум. од. більшою. Тобто інакше може статися, що потребу четвертого споживача необхідно буде задовольняти перевезенням продукції від першого постачальника, що призведе до збільшення вартості цього перевезення в 2,5 рази. Водночас для всіх інших споживачів та постачальників такі різниці є меншими. Отже, найдоцільніше на першому кроці заповнити клітину <sub><img src="/img/image1002.gif"></sub>. Після цього потреби <sub><img src="/img/image976.gif"></sub> повністю задоволені, і всі клітини четвертого стовпчика виключаються з наступного розрахунку різниць по рядках і стовпцях.</p>
<p>Таблиця 7.2.5.</p>
<table border=1>
<tr>
<td><sub><img src="/img/image1028.gif"></sub></p>
<p><sub><img src="/img/image1015.gif"></sub> </td>
<td></p>
<p><sub><img src="/img/image945.gif"></sub></td>
<td></p>
<p><sub><img src="/img/image952.gif"></sub></td>
<td></p>
<p><sub><img src="/img/image1019.gif"></sub></td>
<td></p>
<p><sub><img src="/img/image978.gif"></sub></td>
<td colspan=3></p>
<p>Різниці по рядках</td>
</tr>
<tr>
<td><sub><img src="/img/image947.gif"></sub></td>
<td> 4</p>
<p>110</td>
<td> 4</p>
<p>40</td>
<td> 2</td>
<td> 5</td>
<td></p>
<p> 2</td>
<td></p>
<p> 2</td>
<td></p>
<p> 0</p>
<p> </td>
</tr>
<tr>
<td><sub><img src="/img/image958.gif"></sub></td>
<td> 5</td>
<td> 3</td>
<td> 1</p>
<p>60</td>
<td> 2</td>
<td></p>
<p> 1</td>
<td></p>
<p> 2</td>
<td> </td>
</tr>
<tr>
<td><sub><img src="/img/image1006.gif"></sub></td>
<td> 2</td>
<td> 1</p>
<p>10</td>
<td> 4</td>
<td> 2</p>
<p>80</td>
<td></p>
<p> 1</td>
<td></p>
<p> 1</td>
<td></p>
<p> 1</td>
</tr>
<tr>
<td rowspan=3></p>
<p>Різниці по стовпцях</td>
<td> 2</td>
<td> 2</td>
<td> 1</td>
<td> 3</td>
<td colspan=3> </td>
</tr>
<tr>
<td> 2</td>
<td> 2</td>
<td> 1</td>
<td> </td>
<td colspan=3> </td>
</tr>
<tr>
<td> 2</td>
<td> 3</td>
<td> </td>
<td></p>
<p> </td>
<td colspan=3> </td>
</tr>
</table>
<p>На другому кроці максимальна різниця дорівнює 2 і відповідає першому і другому рядкам та першому і другому стовпчикам, тому можна заповнювати будь-яку їх клітину з мінімальною вартістю, наприклад, <sub><img src="/img/image1031.gif"></sub>. Після цього з розгляду виключаються одразу всі клітини другого рядка та третього стовпця, оскільки потреби третього споживача повністю задоволені, а запаси другого і постачальника вичерпані.</p>
<p>Останній розрахунок різниць (найбільше значення 3 відповідає другому стовпчику) свідчить про доцільність введення поставки від третього постачальника до другого споживача. Решту клітин заповнимо методом мінімальної вартості та визначимо загальну вартість перевезень:</p>
<p><sub><img src="/img/image1033.gif"></sub> (ум.од.).</p>
<p>Результат збігся із значенням цільової функції для опорного плану, що складений за попереднім методом. Ефективність методу апроксимації Фогеля є очевидною для задач більшої розмірності.</p>
<p>Ефективність наведених методів можна оцінювати лише в середньому, оскільки можлива ситуація, що методом мінімальної вартості отримано опорний план транспортної задачі кращий, ніж методом подвійної переваги.</p>
<p><b>7.3. Метод потенціалів розв'язування транспортної задач</b></p>
<p><b><i>Задача, двоїста до транспортної.</i> </b>Один із способів розв’язування транспортної задачі ґрунтується на розгляді двоїстої задачі.<b></b></p>
<p>Розглянемо транспортну задачу (7.1-7.4).</p>
<p>Позначимо змінні двоїстої задачі, які відповідають рівнянням (7.2), через <sub><img src="/img/image1035.gif"></sub>, а для рівнянь (7.3) — через <sub><img src="/img/image1037.gif"></sub>. Оскільки всі обмеження транспортної задачі є рівняннями, то пара спряжених задач є несиметричною і ніякі обмеження на знаки змінних двоїстої задачі <sub><img src="/img/image1035.gif"></sub> та <sub><img src="/img/image1037.gif"></sub> не накладаються.</p>
<p>Для побудови двоїстої задачі поставимо у відповідність обмеженням початкової задачі змінні двоїстої:</p>
<p> <sub><img src="/img/image1041.gif"></sub>   (7.3.1)</p>
<p> <sub><img src="/img/image1043.gif"></sub> <sub><img src="/img/image808.gif"></sub> (7.3.2)</p>
<p><sub><img src="/img/image1045.gif"></sub></p>
<p>Згідно з загальними правилами побудови двоїстих задач маємо:</p>
<p> <sub><img src="/img/image1047.gif"></sub>  (7.3.3)</p>
<p>за умов</p>
<p> <sub><img src="/img/image1049.gif"></sub>  (7.3.4)</p>
<p><sub><img src="/img/image1051.gif"></sub></p>
<p>Змінні <sub><img src="/img/image1053.gif"></sub> та <sub><img src="/img/image1055.gif"></sub> задачі (7.3.3), (7.3.4) двоїстої до транспортної мають назву <b><i>потенціалів</i></b>.</p>
<p>Сформулюємо другу теорему двоїстості для задач (7.1-7.4) та (7.3.3)-(7.3.4).</p>
<p>Для того, щоб плани відповідних спряжених задач були оптимальними, необхідно і достатньо, щоб виконувалися умови доповнюючої нежорсткості:</p>
<p> 1) <sub><img src="/img/image1057.gif"></sub><sub><img src="/img/image1051.gif"></sub> (7.3.5)</p>
<p> 2) <sub><img src="/img/image1059.gif"></sub>  (7.3.6)</p>
<p>Зауважимо, що друга група умов для транспортної задачі виконується автоматично, оскільки всі обмеження задачі є рівняннями.</p>
<p>Перша умова виконується у двох випадках:</p>
<p>а) якщо <sub><img src="/img/image1061.gif"></sub>. Другий співмножник <sub><img src="/img/image1063.gif"></sub>бо за умовою <sub><img src="/img/image1049.gif"></sub>(<sub><img src="/img/image1065.gif"></sub>);</p>
<p>б) якщо <sub><img src="/img/image1067.gif"></sub>, то за умовою транспортної задачі <sub><img src="/img/image1069.gif"></sub>, тоді <sub><img src="/img/image1071.gif"></sub><sub><img src="/img/image1073.gif"></sub> <sub><img src="/img/image1075.gif"></sub> (<sub><img src="/img/image1065.gif"></sub>).</p>
<p>Необхідність і достатність виконання таких умов для оптимальності планів прямої та двоїстої задач було доведено раніше. Отже, як наслідок другої теореми двоїстості для транспортної задачі отримали необхідні та достатні умови оптимальності плану.</p>
<p><b><i>Теорема</i> </b>(<b><i>умова оптимальності опорного плану транспортної задачі</i></b>). <i>Якщо для деякого опорного <sub><img src="/img/image1077.gif"></sub> існують числа <sub><img src="/img/image1053.gif"></sub> та <sub><img src="/img/image1055.gif"></sub>, для яких виконуються умови:</i></p>
<p><i>1) <sub><img src="/img/image1079.gif"></sub>, <sub><img src="/img/image1081.gif"></sub>;</i></p>
<p><i>2) <sub><img src="/img/image1083.gif"></sub>, <sub><img src="/img/image1085.gif"></sub></i></p>
<p><i>для всіх <sub><img src="/img/image1087.gif"></sub>, то він є оптимальним планом транспортної задачі.</i></p>
<p>Використовуючи наведені умови існування розв'язку транспортної задачі, методи побудови опорних планів та умову оптимальності опорного плану транспортної задачі, сформулюємо алгоритм методу потенціалів, який по суті повторює кроки алгоритму симплексного методу.</p>
<p><b><i>Алгоритм методу потенціалів</i></b> складається з таких етапів:</p>
<p><b><i>1.</i> </b>Визначення типу транспортної задачі (відкрита чи закрита). За необхідності слід звести задачу до закритого типу.</p>
<p><b><i>2.</i> </b>Побудова першого опорного плану транспортної задачі одним з відомих методів.</p>
<p><b><i>3.</i> </b>Перевірка опорного плану задачі на виродженість. За необхідності вводять нульові постачання.</p>
<p><b><i>4.</i> </b>Перевірка плану транспортної задачі на оптимальність.</p>
<p><b><i>4.1.</i></b> Визначення потенціалів для кожного рядка і стовпчика таблиці транспортної задачі. Потенціали опорного плану визначають із системи рівнянь <sub><img src="/img/image1079.gif"></sub>, які записують для всіх заповнених клітинок транспортної таблиці, кількість яких дорівнює <sub><img src="/img/image939.gif"></sub>, а кількість невідомих - <sub><img src="/img/image1090.gif"></sub>. Кількість рівнянь на одне менша, ніж невідомих, тому система є невизначеною, і одному з потенціалів надають нульове значення. Після цього всі інші потенціали розраховують однозначно.</p>
<p><b><i>4.2.</i></b> Перевірка виконання умови оптимальності для пустих клітин. За допомогою розрахованих потенціалів перевіряють умову оптимальності <sub><img src="/img/image1083.gif"></sub> для незаповнених клітинок таблиці. Якщо хоча б для однієї клітини ця умова не виконується, тобто <sub><img src="/img/image1092.gif"></sub>, то поточний план є неоптимальним, і від нього необхідно перейти до нового опорного плану.</p>
<p><b><i>4.3.</i></b> Вибір змінної для введення в базис на наступному кроці. Загальне правило переходу від одного опорного плану до іншого полягає в тому, що з попереднього базису виводять певну змінну (вектор), а на її місце вводять іншу змінну (вектор), яка має покращити значення цільової функції. Аналогічна операція здійснюється і в алгоритмі методу потенціалів.</p>
<p>Перехід від одного опорного плану до іншого виконують заповненням клітинки, для якої порушено умову оптимальності. Якщо таких клітинок кілька, то для заповнення вибирають таку, що має найбільше порушення, тобто <sub><img src="/img/image1094.gif"></sub>.</p>
<p><b><i>4.4.</i></b> Побудова циклу і перехід до наступного опорного плану. Вибрана порожня клітина разом з іншими заповненими становить <sub><img src="/img/image1096.gif"></sub>, отже, з цих клітин обов'язково утвориться цикл. У межах даного циклу здійснюють перерахування, які приводять до перерозподілу постачань продукції. Кожній вершині циклу приписують певний знак, причому вільній клітинці - знак «+», а всім іншим — за черговістю знаки «-» та «+». У клітинках зі знаком «-» вибирають значення <sub><img src="/img/image1098.gif"></sub> і переносять його у порожню клітинку. Одночасно це число додають до відповідних чисел, які містяться в клітинках зі знаком «+», та віднімають від чисел, що позначені знаком «-». Якщо значенню <sub><img src="/img/image1100.gif"></sub> відповідає кіль­ка однакових перевезень, то при відніманні залишаємо у відповідних клітинках нульові величини перевезень у такій кількості, що дає змогу зберегти невиродженість опорного плану.</p>
<p>Внаслідок наведеного правила вибору <sub><img src="/img/image1100.gif"></sub> дістаємо новий опорний план, який не містить від'ємних перевезень і задовольняє умови транспортної задачі. Оскільки кількість всіх клітин таблиці, що входять у цикл, є парною і до половини з них те саме чисті <sub><img src="/img/image1100.gif"></sub> додається, а від половини віднімається, то загальна сума перевезень по всіх колонках і рядках залишається незмінною.</p>
<p>Доведемо ациклічність нового плану. Вектор умов, який відповідає приєднаній клітині, є лінійною комбінацією векторів базису, які утворюють разом з ним цикл, бо ці вектори входять у згадану комбінацію з відмінними від нуля коефіцієнтами. Виключення з циклу одного з базисних векторів приводить до нової системи з <sub><img src="/img/image939.gif"></sub> лінійно незалежними векторами, бо інакше введений у новий базис вектор мав би два різних розклади через вектори попереднього базису, що неможливо. А системі лінійно незалежних векторів відповідає ациклічна сукупність клітин таблиці транспортної задачі, що й потрібно було довести.</p>
<p>Отже, клітинка, що була вільною, стає заповненою, а відповідна клітинка з мінімальною величиною <sub><img src="/img/image795.gif"></sub> вважається порожньою. У результаті такого перерозподілу перевезень продукції дістанемо новий опорний план транспортної задачі.</p>
<p><b><i>5.</i> </b>Перевірка умови оптимальності наступного опорного плану. Якщо умова оптимальності виконується — маємо оптимальний план задачі, інакше необхідно перейти до наступного опорного плану (тобто повернутися до пункту 3 даного алгоритму).</p>
<p>Зауважимо, що аналогічно з розв'язуванням загальної задачі лінійного програмування симплексним методом, якщо за перевірки оптимального плану транспортної задачі для деяких клітин виконується рівність <sub><img src="/img/image1079.gif"></sub>, то це означає, що задача має альтернативні оптимальні плани. Отримати їх можна, якщо побудувати цикли перерозподілу обсягів перевезень для відповідних клітин.</p>
<p><b>7.4. Транспортна задача з додатковими умовами</b></p>
<p>На практиці в задачах, що пов'язані з перевезеннями, часто доводиться враховувати додаткові умови: неможливість здійснення перевезень за окремими маршрутами; необхідність перевезень неоднорідної продукції тощо. Такі умови ускладнюють математичну постановку транспортної задачі та вимагають особливих підходів до її розв'язання.</p>
<p>Розглянемо кілька особливостей відкритих транспортних задач з додатковими умовами.</p>
<p>1. Додаткова умова заборони перевезень від певного постачальника до певного споживача. В такому разі в оптимальному плані відповідні клітини обов'язково мають бути вільними ( <sub><img src="/img/image1104.gif"></sub> ).</p>
<p>Розв'язуючи транспортну задачу з додатковою умовою на заборону окремих постачань, необхідно у відповідних клітинах замінити значення вартостей перевезень одиниці продукції на деяке велике число (ставиться досить велике число <sub><img src="/img/image1106.gif"></sub>). Оскільки розглянуті вище методи розв'язання транспортних задач уможливлюють організацію перевезень у такий спосіб, що мінімізується загальна вартість витрат на транспортування, то це зумовить з розгляду перевезень з надто великими вартостями, що забезпечить виконання такої додаткової умови.</p>
<p>2. Додаткова умова перевезення за окремими маршрутами строго визначеного обсягу продукції, тобто виконання обов'язкових постачань. В оптимальному плані відкритої транспортної задачі з такою додатковою умовою клітини відповідних фіктивно введених постачальників чи споживачів мають бути вільними.</p>
<p>Розв'язуючи такого типу транспортну задачу, необхідно у відповідних клітинах також збільшити значення вартостей перевезень (ставиться досить велике число <sub><img src="/img/image1106.gif"></sub>).</p>
<p>3. Додаткова умова необхідності перевезення від <sub><img src="/img/image166.gif"></sub>-го постачальника <sub><img src="/img/image201.gif"></sub>-му споживачеві не менше <sub><img src="/img/image1109.gif"></sub> одиниць продукції, тобто вводиться додаткове обмеження виду: <sub><img src="/img/image1111.gif"></sub>.</p>
<p>Розв'язуючи транспортну задачу з такою додатковою умовою, необхідно змінити початкові умови: обсяг постачання <sub><img src="/img/image1109.gif"></sub> відняти від обсягу запасу <sub><img src="/img/image166.gif"></sub>-го постачальника ( <sub><img src="/img/image1113.gif"></sub> ) та від потреби <sub><img src="/img/image201.gif"></sub>-го споживача ( <sub><img src="/img/image1115.gif"></sub> ). Знайдений оптимальний план транспортної задачі зі зміненими умовами (де використані значення <sub><img src="/img/image1117.gif"></sub>) коригується, враховуючи обмеження <sub><img src="/img/image1111.gif"></sub>.</p>
<p>1.  Додаткова умова необхідності перевезення від <sub><img src="/img/image166.gif"></sub>-го постачальника <sub><img src="/img/image201.gif"></sub>-му споживачеві не більше <sub><img src="/img/image1109.gif"></sub> одиниць продукції, тобто вводиться додаткове обмеження виду: <sub><img src="/img/image1111.gif"></sub></p>
<p>Для виконання такої додаткової умови необхідно в транспортну таблицю <sub><img src="/img/image201.gif"></sub>-го споживача записати двічі. Один раз його потреби визначатимуться величиною <sub><img src="/img/image1109.gif"></sub>, а другий раз — різницею <sub><img src="/img/image1121.gif"></sub>. Витрати на перевезення одиниці продукції в обох стовпцях повинні бути однаковими за винятком клітини на перетині <sub><img src="/img/image166.gif"></sub>-го постачальника і <sub><img src="/img/image201.gif"></sub>-го споживача з потребою <sub><img src="/img/image1124.gif"></sub>. У цій клітині ставиться досить велике число <sub><img src="/img/image1106.gif"></sub>. В такій постановці задача розв'язується відомими методами.</p>
<p>2.  На практиці часто потрібно визначити оптимальний план перевезень неоднорідної продукції, тобто розв'язати багатопродуктову задачу. Її математична модель має такий вигляд:</p>
<p><sub><img src="/img/image1126.gif"></sub>;</p>
<p><sub><img src="/img/image1128.gif"></sub>;</p>
<p><sub><img src="/img/image1130.gif"></sub>;</p>
<p><sub><img src="/img/image1132.gif"></sub>,</p>
<p>де <sub><img src="/img/image1134.gif"></sub> — індекс виду продукції, що необхідно перевезти.</p>
<p>Розв'язуючи багатопродуктову транспортну задачу, потрібно заблокувати ті клітини, які зв'язують постачальників і споживачів щодо постачань різної продукції. Таке блокування здійснюється введенням досить високих вартостей перевезень одиниці продукції (великого числа <sub><img src="/img/image1106.gif"></sub>), але слід зауважити, що наявність заблокованих клітин може призвести до неможливості розв'язання задачі. Тому в такому разі необхідно перевіряти, чи є достатня кількість незаблокованих перевезень для побудови опорного плану задачі, який повинен містити <sub><img src="/img/image1136.gif"></sub> додатну змінну.</p>
</div>
