<div id="main-midle">
	<h1>Глави</h1>
	<h2>
		Глава №1.
		<a href="/chapter/1">Історія зародження і створення лінійного програмування</a>
	</h2>
	<p>
		Кожна людина щодня, не завжди усвідомлюючи це, вирішує проблему: як
		одержати найбільший ефект, володіючи обмеженими засобами. Наші засоби і
		ресурси завжди обмежені. Життя було б менш цікаве, якби це було не так. Не
		важко виграти бій, маючи армію в 10 разів більшу, ніж у супротивника. Щоб
		досягти найбільшого ефекту, маючи обмежені засоби, треба скласти план чи
		програму дій. Раніше план в таких випадках складався «на око». У середині XX
		століття був створений спеціальний математичний апарат, що допомагає це
		робити «по науці»...
	</p>
	<h2>
		Глава №2.
		<a href="/chapter/2">Основні поняття систем лінійних рівнянь і нерівностей</a>
	</h2>
	<p>
		Розглянемо спочатку узагальнення деяких понять в просторі <sub><img src="img/image002.gif"></sub> довільної скінченної розмірності <sub><img src="img/image004.gif"></sub> над полем дійсних чисел (<sub><img src="img/image006.gif"></sub>). Вираз виду<br/>
		<sub><img src="img/image008.gif"></sub>  (2.1) <br/>
		називають <b><i>лінійним рівнянням з <sub><img src="img/image004.gif"></sub> невідомими</i></b>. Вираз виду <sub><img src="img/image010.gif"></sub>  (2.2)</p>
		де <sub><img src="img/image012.gif"></sub>- це один із знаків...
	</p>
	<h2>
		Глава №3.
		<a href="/chapter/3">Поняття задачі лінійного програмування та різні форми її задання</a>
	</h2>
	<p>
		<i>Під <b>задачею</b> лінійного програмування в загальному вигляді розуміють задачу знаходження мінімуму (максимуму) лінійної функції від <sub><img src="img/image004.gif"></sub> змінних на множині розв’язків системи лінійних нерівностей або лінійних рівнянь.</i> Розглянемо це на конкретному прикладі...
	</p>	
	<h2>
		Глава №4.
		<a href="/chapter/4">Геометрична інтерпретація задачі лінійного програмування</a>
	</h2>
	<p>
	</p>
	<h2>
		Глава №5.
		<a href="/chapter/5">Симплексний метод розв'язування задач лінійного програмування</a>
	</h2>
	<p>
		
	</p>
	<h2>
		Глава №6.
		<a href="/chapter/6">Транспортна задача лінійного програмування</a>
	</h2>
	<p>
		
	</p>
</div>
